{
    "settings": {
        "theme": "D&D",
        "label": "purple",
        "ChaNumber": 1
    },
    "content": {
        "1. Traps": "# Traps\n\nTraps can be found almost anywhere. One wrong step in an ancient tomb might trigger a series of scything blades, which cleave through armor and bone. The seemingly innocuous vines that hang over a cave entrance might grasp and choke anyone who pushes through them. A net hidden among the trees might drop on travelers who pass underneath. In a fantasy game, unwary adventurers can fall to their deaths, be burned alive, or fall under a fusillade of poisoned darts.\n\nA trap can be either mechanical or magical in nature. **Mechanical traps** include pits, arrow traps, falling blocks, water-filled rooms, whirling blades, and anything else that depends on a mechanism to operate. **Magic traps** are either magical device traps or spell traps. Magical device traps initiate spell effects when activated. Spell traps are spells such as glyph of warding and symbol that function as traps.\n\n### Traps in Play\n\nWhen adventurers come across a trap, you need to know how the trap is triggered and what it does, as well as the possibility for the characters to detect the trap and to disable or avoid it.\n\n#### Triggering a Trap\n\nMost traps are triggered when a creature goes somewhere or touches something that the trap's creator wanted to protect. Common triggers include stepping on a pressure plate or a false section of floor, pulling a trip wire, turning a doorknob, and using the wrong key in a lock. Magic traps are often set to go off when a creature enters an area or touches an object. Some magic traps (such as the  Glyph of Warding **spell) have more complicated trigger conditions, including a password that prevents the trap from activating.\n\n#### Detecting and Disabling a Trap\n\nUsually, some element of a trap is visible to careful inspection. Characters might notice an uneven flagstone that conceals a pressure plate, spot the gleam of light off a trip wire, notice small holes in the walls from which jets of flame will erupt, or otherwise detect something that points to a trap's presence.\n\nA trap's description specifies the checks and DCs needed to detect it, disable it, or both. A character actively looking for a trap can attempt a Wisdom (Perception) check against the trap's DC. You can also compare the DC to detect the trap with each character's passive Wisdom (Perception) score to determine whether anyone in the party notices the trap in passing. If the adventurers detect a trap before triggering it, they might be able to disarm it, either permanently or long enough to move past it. You might call for an Intelligence (Investigation) check for a character to deduce what needs to be done, followed by a Dexterity check using thieves' tools to perform the necessary sabotage.\n\nAny character can attempt an Intelligence (Arcana) check to detect or disarm a magic trap, in addition to any other checks noted in the trap's description. The DCs are the same regardless of the check used. In addition,  Dispel Magic has a chance of disabling most magic traps. A magic trap's description provides the DC for the ability check made when you use *dispel magic*.\n\nIn most cases, a trap's description is clear enough that you can adjudicate whether a character's actions locate or foil the trap. As with many situations, you shouldn't allow die rolling to override clever play and good planning. Use your common sense, drawing on the trap's description to determine what happens. No trap's design can anticipate every possible action that the characters might attempt.\n\nYou should allow a character to discover a trap without making an ability check if an action would clearly reveal the trap's presence. For example, if a character lifts a rug that conceals a pressure plate, the character has found the trigger and no check is required.\n\nFoiling traps can be a little more complicated. Consider a trapped treasure chest. If the chest is opened without first pulling on the two handles set in its sides, a mechanism inside fires a hail of poison needles toward anyone in front of it. After inspecting the chest and making a few checks, the characters are still unsure if it's trapped. Rather than simply open the chest, they prop a shield in front of it and push the chest open at a distance with an iron rod. In this case, the trap still triggers, but the hail of needles fires harmlessly into the shield.\n\nTraps are often designed with mechanisms that allow them to be disarmed or bypassed. Intelligent monsters that place traps in or around their lairs need ways to get past those traps without harming themselves. Such traps might have hidden levers that disable their triggers, or a secret door might conceal a passage that goes around the trap.\n\n#### Trap Effects\n\nThe effects of traps can range from inconvenient to deadly, making use of elements such as arrows, spikes, blades, poison, toxic gas, blasts of fire, and deep pits. The deadliest traps combine multiple elements to kill, injure, contain, or drive off any creature unfortunate enough to trigger them. A trap's description specifies what happens when it is triggered.\n\nThe attack bonus of a trap, the save DC to resist its effects, and the damage it deals can vary depending on the trap's severity. Use the Trap Save DCs and Attack Bonuses table and the Damage Severity by Level table for suggestions based on three levels of trap severity.\n\nA trap intended to be a **setback** is unlikely to kill or seriously harm characters of the indicated levels, whereas a **dangerous** trap is likely to seriously injure (and potentially kill) characters of the indicated levels. A **deadly** trap is likely to kill characters of the indicated levels.\n\n##### Trap Save DCs and Attack Bonuses\n\n| Trap Danger | Save DC | Attack Bonus |\n|-------------|---------|--------------|\n| Setback     | 10–11   | +3 to +5 ([3](to hit \"3\")/[4](to hit \"4\")/[5](to hit \"5\"))    |\n| Dangerous   | 12–15   | +6 to +8 ([6](to hit \"6\")/[7](to hit \"7\")/[8](to hit \"8\"))    |\n| Deadly      | 16–20   | +9 to +12 ([9](to hit \"9\")/[10](to hit \"10\")/[11](to hit \"11\")/[12](to hit \"12\"))   |\n\n##### Damage Severity by Level\n\n| Character Level | Setback | Dangerous | Deadly |\n|-----------------|---------|-----------|--------|\n| 1st–4th         | 1d10    | 2d10      | 4d10   |\n| 5th–10th        | 2d10    | 4d10      | 10d10  |\n| 11th–16th       | 4d10    | 10d10     | 18d10  |\n| 17th–20th       | 10d10   | 18d10     | 24d10  |\n\n#### Complex Traps\n\nComplex traps work like standard traps, except once activated they execute a series of actions each round. A complex trap turns the process of dealing with a trap into something more like a combat encounter.\n\nWhen a complex trap activates, it rolls initiative. The trap's description includes an initiative bonus. On its turn, the trap activates again, often taking an action. It might make successive attacks against intruders, create an effect that changes over time, or otherwise produce a dynamic challenge. Otherwise, the complex trap can be detected and disabled or bypassed in the usual ways.\n\nFor example, a trap that causes a room to slowly flood works best as a complex trap. On the trap's turn, the water level rises. After several rounds, the room is completely flooded.\n\n### Sample Traps\n\nThe magical and mechanical traps presented here vary in deadliness and are presented in alphabetical order.\n\n#### Collapsing Roof\n\n*Mechanical trap*\n\nThis trap uses a trip wire to collapse the supports keeping an unstable section of a ceiling in place.\n\nThe trip wire is 3 inches off the ground and stretches between two support beams. The DC to spot the trip wire is 10. A successful DC 15 Dexterity check using thieves' tools disables the trip wire harmlessly. A character without thieves' tools can attempt this check with disadvantage using any edged weapon or edged tool. On a failed check, the trap triggers.\n\nAnyone who inspects the beams can easily determine that they are merely wedged in place. As an action, a character can knock over a beam, causing the trap to trigger.\n\nThe ceiling above the trip wire is in bad repair, and anyone who can see it can tell that it's in danger of collapse.\n\nWhen the trap is triggered, the unstable ceiling collapses. Any creature in the area beneath the unstable section must succeed on a DC 15 Dexterity saving throw, taking 22 (4d10) bludgeoning damage on a failed save, or half as much damage on a successful one. Once the trap is triggered, the floor of the area is filled with rubble and becomes difficult terrain.\n\n#### Falling Net\n\n*Mechanical trap*\n\nThis trap uses a trip wire to release a net suspended from the ceiling.\n\nThe trip wire is 3 inches off the ground and stretches between two columns or trees. The net is hidden by cobwebs or foliage. The DC to spot the trip wire and net is 10. A successful DC 15 Dexterity check using thieves' tools breaks the trip wire harmlessly. A character without thieves' tools can attempt this check with disadvantage using any edged weapon or edged tool. On a failed check, the trap triggers.\n\nWhen the trap is triggered, the net is released, covering a 10-foot-square area. Those in the area are trapped under the net and restrained, and those that fail a DC 10 Strength saving throw are also knocked prone. A creature can use its action to make a DC 10 Strength check, freeing itself or another creature within its reach on a success. The net has AC 10 and 20 hit points. Dealing 5 slashing damage to the net (AC 10) destroys a 5-foot-square section of it, freeing any creature trapped in that section.\n\n#### Fire-Breathing Statue\n\n*Magic trap*\n\nThis trap is activated when an intruder steps on a hidden pressure plate, releasing a magical gout of flame from a nearby statue. The statue can be of anything, including a dragon or a wizard casting a spell.\n\nThe DC is 15 to spot the pressure plate, as well as faint scorch marks on the floor and walls. A spell or other effect that can sense the presence of magic, such as detect magic, reveals an aura of evocation magic around the statue.\n\nThe trap activates when more than 20 pounds of weight is placed on the pressure plate, causing the statue to release a 30-foot cone of fire. Each creature in the fire must make a DC 13 Dexterity saving throw, taking 22 (4d10) fire damage on a failed save, or half as much damage on a successful one.\n\nWedging an iron spike or other object under the pressure plate prevents the trap from activating. A successful dispel magic (DC 13) cast on the statue destroys the trap.\n\n#### Pits\n\n*Mechanical trap*\n\nFour basic pit traps are presented here.\n\n**Simple Pit.** A simple pit trap is a hole dug in the ground. The hole is covered by a large cloth anchored on the pit's edge and camouflaged with dirt and debris.\n\nThe DC to spot the pit is 10. Anyone stepping on the cloth falls through and pulls the cloth down into the pit, taking damage based on the pit's depth (usually 10 feet, but some pits are deeper).\n\n**Hidden Pit.** This pit has a cover constructed from material identical to the floor around it.\n\nA successful DC 15 Wisdom (Perception) check discerns an absence of foot traffic over the section of floor that forms the pit's cover. A successful DC 15 Intelligence (Investigation) check is necessary to confirm that the trapped section of floor is actually the cover of a pit.\n\nWhen a creature steps on the cover, it swings open like a trapdoor, causing the intruder to spill into the pit below. The pit is usually 10 or 20 feet deep but can be deeper.\n\nOnce the pit trap is detected, an iron spike or similar object can be wedged between the pit's cover and the surrounding floor in such a way as to prevent the cover from opening, thereby making it safe to cross. The cover can also be magically held shut using the *arcane lock* spell or similar magic.\n\n**Locking Pit.** This pit trap is identical to a hidden pit trap, with one key exception: the trap door that covers the pit is spring-loaded. After a creature falls into the pit, the cover snaps shut to trap its victim inside.\n\nA successful DC 20 Strength check is necessary to pry the cover open. The cover can also be smashed open. A character in the pit can also attempt to disable the spring mechanism from the inside with a DC 15 Dexterity check using thieves' tools, provided that the mechanism can be reached and the character can see. In some cases, a mechanism (usually hidden behind a secret door nearby) opens the pit.\n\n**Spiked Pit.** This pit trap is a simple, hidden, or locking pit trap with sharpened wooden or iron spikes at the bottom. A creature falling into the pit takes 11 (2d10) piercing damage from the spikes, in addition to any falling damage. Even nastier versions have poison smeared on the spikes. In that case, anyone taking piercing damage from the spikes must also make a DC 13 Constitution saving throw, taking an 22 (4d10) poison damage on a failed save, or half as much damage on a successful one.\n\n#### Poison Darts\n\n*Mechanical trap*\n\nWhen a creature steps on a hidden pressure plate, poison-tipped darts shoot from spring-loaded or pressurized tubes cleverly embedded in the surrounding walls. An area might include multiple pressure plates, each one rigged to its own set of darts.\n\nThe tiny holes in the walls are obscured by dust and cobwebs, or cleverly hidden amid bas-reliefs, murals, or frescoes that adorn the walls. The DC to spot them is 15. With a successful DC 15 Intelligence (Investigation) check, a character can deduce the presence of the pressure plate from variations in the mortar and stone used to create it, compared to the surrounding floor. Wedging an iron spike or other object under the pressure plate prevents the trap from activating. Stuffing the holes with cloth or wax prevents the darts contained within from launching.\n\nThe trap activates when more than 20 pounds of weight is placed on the pressure plate, releasing four darts. Each dart makes a ranged attack with a +8 bonus against a random target within 10 feet of the pressure plate (vision is irrelevant to this attack roll). (If there are no targets in the area, the darts don't hit anything.) A target that is hit takes 2 (1d4) piercing damage and must succeed on a DC 15 Constitution saving throw, taking 11 (2d10) poison damage on a failed save, or half as much damage on a successful one.\n\n#### Poison Needle\n\n*Mechanical trap*\n\nA poisoned needle is hidden within a treasure chest's lock, or in something else that a creature might open. Opening the chest without the proper key causes the needle to spring out, delivering a dose of poison.\n\nWhen the trap is triggered, the needle extends 3 inches straight out from the lock. A creature within range takes 1 piercing damage and 11 (2d10) poison damage, and must succeed on a DC 15 Constitution saving throw or be poisoned for 1 hour.\n\nA successful DC 20 Intelligence (Investigation) check allows a character to deduce the trap's presence from alterations made to the lock to accommodate the needle. A successful DC 15 Dexterity check using thieves' tools disarms the trap, removing the needle from the lock. Unsuccessfully attempting to pick the lock triggers the trap.\n\n#### Rolling Sphere\n\n*Mechanical trap*\n\nWhen 20 or more pounds of pressure are placed on this trap's pressure plate, a hidden trapdoor in the ceiling opens, releasing a 10-foot-diameter rolling sphere of solid stone.\n\nWith a successful DC 15 Wisdom (Perception) check, a character can spot the trapdoor and pressure plate. A search of the floor accompanied by a successful DC 15 Intelligence (Investigation) check reveals variations in the mortar and stone that betray the pressure plate's presence. The same check made while inspecting the ceiling notes variations in the stonework that reveal the trapdoor. Wedging an iron spike or other object under the pressure plate prevents the trap from activating.\n\nActivation of the sphere requires all creatures present to roll initiative. The sphere rolls initiative with a +8 bonus. On its turn, it moves 60 feet in a straight line. The sphere can move through creatures' spaces, and creatures can move through its space, treating it as difficult terrain. Whenever the sphere enters a creature's space or a creature enters its space while it's rolling, that creature must succeed on a DC 15 Dexterity saving throw or take 55 (10d10) bludgeoning damage and be knocked prone.\n\nThe sphere stops when it hits a wall or similar barrier. It can't go around corners, but smart dungeon builders incorporate gentle, curving turns into nearby passages that allow the sphere to keep moving.\n\nAs an action, a creature within 5 feet of the sphere can attempt to slow it down with a DC 20 Strength check. On a successful check, the sphere's speed is reduced by 15 feet. If the sphere's speed drops to 0, it stops moving and is no longer a threat.\n\n#### Sphere of Annihilation\n\n*Magic trap*\n\nMagical, impenetrable darkness fills the gaping mouth of a stone face carved into a wall. The mouth is 2 feet in diameter and roughly circular. No sound issues from it, no light can illuminate the inside of it, and any matter that enters it is instantly obliterated.\n\nA successful DC 20 Intelligence (Arcana) check reveals that the mouth contains a *sphere of annihilation* that can't be controlled or moved. It is otherwise identical to a normal *sphere of annihilation*.\n\nSome versions of the trap include an enchantment placed on the stone face, such that specified creatures feel an overwhelming urge to approach it and crawl inside its mouth. This effect is otherwise like the *sympathy* aspect of the  [Antipathy/Sympathy](spell) spell. A successful  [Dispel Magic](spell) (DC 18) removes this enchantment.",
        "2. Diseases": "# Diseases\n\nA plague ravages the kingdom, setting the adventurers on a quest to find a cure. An adventurer emerges from an ancient tomb, unopened for centuries, and soon finds herself suffering from a wasting illness. A warlock offends some dark power and contracts a strange affliction that spreads whenever he casts spells.\n\nA simple outbreak might amount to little more than a small drain on party resources, curable by a casting of *lesser restoration*. A more complicated outbreak can form the basis of one or more adventures as characters search for a cure, stop the spread of the disease, and deal with the consequences.\n\nA disease that does more than infect a few party members is primarily a plot device. The rules help describe the effects of the disease and how it can be cured, but the specifics of how a disease works aren't bound by a common set of rules. Diseases can affect any creature, and a given illness might or might not pass from one race or kind of creature to another. A plague might affect only constructs or undead, or sweep through a halfling neighborhood but leave other races untouched. What matters is the story you want to tell.\n\n### Sample Diseases\n\nThe diseases here illustrate the variety of ways disease can work in the game. Feel free to alter the saving throw DCs, incubation times, symptoms, and other characteristics of these diseases to suit your campaign.\n\n#### Cackle Fever\n\nThis disease targets humanoids, although gnomes are strangely immune. While in the grips of this disease, victims frequently succumb to fits of mad laughter, giving the disease its common name and its morbid nickname: “the shrieks.”\n\nSymptoms manifest 1d4 hours after infection and include fever and disorientation. The infected creature gains one level of exhaustion that can't be removed until the disease is cured.\n\nAny event that causes the infected creature great stress—including entering combat, taking damage, experiencing fear, or having a nightmare—forces the creature to make a DC 13 Constitution saving throw. On a failed save, the creature takes 5 (1d10) psychic damage and becomes incapacitated with mad laughter for 1 minute. The creature can repeat the saving throw at the end of each of its turns, ending the mad laughter and the incapacitated condition on a success.\n\nAny humanoid creature that starts its turn within 10 feet of an infected creature in the throes of mad laughter must succeed on a DC 10 Constitution saving throw or also become infected with the disease. Once a creature succeeds on this save, it is immune to the mad laughter of that particular infected creature for 24 hours.\n\nAt the end of each long rest, an infected creature can make a DC 13 Constitution saving throw. On a successful save, the DC for this save and for the save to avoid an attack of mad laughter drops by 1d6. When the saving throw DC drops to 0, the creature recovers from the disease. A creature that fails three of these saving throws gains a randomly determined form of indefinite madness, as described later.\n\n#### Sewer Plague\n\nSewer plague is a generic term for a broad category of illnesses that incubate in sewers, refuse heaps, and stagnant swamps, and which are sometimes transmitted by creatures that dwell in those areas, such as rats and otyughs.\n\nWhen a humanoid creature is bitten by a creature that carries the disease, or when it comes into contact with filth or offal contaminated by the disease, the creature must succeed on a DC 11 Constitution saving throw or become infected.\n\nIt takes 1d4 days for sewer plague's symptoms to manifest in an infected creature. Symptoms include fatigue and cramps. The infected creature suffers one level of exhaustion, and it regains only half the normal number of hit points from spending Hit Dice and no hit points from finishing a long rest.\n\nAt the end of each long rest, an infected creature must make a DC 11 Constitution saving throw. On a failed save, the character gains one level of exhaustion. On a successful save, the character's exhaustion level decreases by one level. If a successful saving throw reduces the infected creature's level of exhaustion below 1, the creature recovers from the disease.\n\n#### Sight Rot\n\nThis painful infection causes bleeding from the eyes and eventually blinds the victim.\n\nA beast or humanoid that drinks water tainted by sight rot must succeed on a DC 15 Constitution saving throw or become infected. One day after infection, the creature's vision starts to become blurry. The creature takes a −1 penalty to attack rolls and ability checks that rely on sight. At the end of each long rest after the symptoms appear, the penalty worsens by 1. When it reaches −5, the victim is blinded until its sight is restored by magic such as  *[Lesser Restoration](spell)* or  [Heal](spell).\n\nSight rot can be cured using a rare flower called Eyebright, which grows in some swamps. Given an hour, a character who has proficiency with an herbalism kit can turn the flower into one dose of ointment. Applied to the eyes before a long rest, one dose of it prevents the disease from worsening after that rest. After three doses, the ointment cures the disease entirely.",
        "3. Madness": "# Madness\n\nIn a typical campaign, characters aren't driven mad by the horrors they face and the carnage they inflict day after day, but sometimes the stress of being an adventurer can be too much to bear. If your campaign has a strong horror theme, you might want to use madness as a way to reinforce that theme, emphasizing the extraordinarily horrific nature of the threats the adventurers face.\n\n### Going Mad\n\nVarious magical effects can inflict madness on an otherwise stable mind. Certain spells, such as contact other plane and symbol, can cause insanity, and you can use the madness rules here instead of the spell effects of those spells. Diseases, poisons, and planar effects such as psychic wind or the howling winds of Pandemonium can all inflict madness. Some artifacts can also break the psyche of a character who uses or becomes attuned to them.\n\nResisting a madness-inducing effect usually requires a Wisdom or Charisma saving throw.\n\n### Madness Effects\n\nMadness can be short-term, long-term, or indefinite. Most relatively mundane effects impose short-term madness, which lasts for just a few minutes. More horrific effects or cumulative effects can result in long-term or indefinite madness.\n\nA character afflicted with **short-term madness** is subjected to an effect from the Short-Term Madness table for 1d10 minutes.\n\nA character afflicted with **long-term madness** is subjected to an effect from the Long-Term Madness table for 1d10 × 10 hours.\n\nA character afflicted with **indefinite madness** gains a new character flaw from the Indefinite Madness table that lasts until cured.\n\n##### Short-Term Madness\n\n|  d100  | Effects (lasts 1d10 minutes)                                                                                                 |\n|:------:|------------------------------------------------------------------------------------------------------------------------------|\n|  01-20 | The character retreats into his or her mind and becomes paralyzed. The effect ends if the character takes any damage.        |\n|  21-30 | The character becomes incapacitated and spends the duration screaming, laughing, or weeping.                                 |\n|  31-40 | The character becomes frightened and must use his or her action and movement each round to flee from the source of the fear. |\n|  41-50 | The character begins babbling and is incapable of normal speech or spellcasting.                                             |\n|  51-60 | The character must use his or her action each round to attack the nearest creature.                                          |\n|  61-70 | The character experiences vivid hallucinations and has disadvantage on ability checks.                                       |\n|  71-75 | The character does whatever anyone tells him or her to do that isn&apos;t obviously self-destructive.                             |\n|  76-80 | The character experiences an overpowering urge to eat something strange such as dirt, slime, or offal.                       |\n|  81-90 | The character is stunned.                                                                                                    |\n| 91-100 | The character falls unconscious.                                                                                             |\n\n##### Long-Term Madness\n\n|  d100  | Effects (lasts 1d10 × 10 hours)                                                                                                                                                                                                      |\n|:------:|--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n|  01-10 | The character feels compelled to repeat a specific activity over and over, such as washing hands, touching things, praying, or counting coins.                                                                                       |\n|  11-20 | The character experiences vivid hallucinations and has disadvantage on ability checks.                                                                                                                                               |\n|  21-30 | The character suffers extreme paranoia. The character has disadvantage on Wisdom and Charisma checks                                                                                                                                 |\n|  31-40 | The character regards something (usually the source of madness) with intense revulsion, as if affected by the antipathy effect of the antipathy/sympathy spell.                                                                      |\n|  41-45 | The character experiences a powerful delusion. Choose a potion. The character imagines that he or she is under its effects.                                                                                                          |\n|  46-55 | The character becomes attached to a \"lucky charm,\" such as a person or an object, and has disadvantage on attack rolls, ability checks, and saving throws while more than 30 feet from it.                                           |\n|  56-65 | The character is blinded (25%) or deafened (75%).                                                                                                                                                                                    |\n|  66-75 | The character experiences uncontrollable tremors or tics, which impose disadvantage on attack rolls, ability checks, and saving throws that involve Strength or Dexterity.                                                           |\n|  76-85 | The character suffers from partial amnesia. The character knows who he or she is and retains racial traits and class features, but doesn&apos;t recognize other people or remember anything that happened before the madness took effect. |\n|  86-90 | Whenever the character takes damage, he or she must succeed on a DC 15 Wisdom saving throw or be affected as though he or she failed a saving throw against the confusion spell. The confusion effect lasts for 1 minute.            |\n|  91-95 | The character loses the ability to speak.                                                                                                                                                                                            |\n| 96-100 | The character falls unconscious. No amount of jostling or damage can wake the character.                                                                                                                                             |\n\n##### Indefinite Madness\n\n|  d100  | Flaw (lasts until cured)                                                                                                                 |\n|:------:|------------------------------------------------------------------------------------------------------------------------------------------|\n|  01-15 | \"Being drunk keeps me sane.\"                                                                                                             |\n|  16-25 | \"I keep whatever I find.\"                                                                                                                |\n|  26-30 | \"I try to become more like someone else I know—adopting his or her style of dress, mannerisms, and name.\"                                |\n|  31-35 | \"I must bend the truth, exaggerate, or outright lie to be interesting to other people.\"                                                  |\n|  36-45 | \"Achieving my goal is the only thing of interest to me, and I&apos;ll ignore everything else to pursue it.\"                                   |\n|  46-50 | \"I find it hard to care about anything that goes on around me.\"                                                                          |\n|  51-55 | \"I don&apos;t like the way people judge me all the time.\"                                                                                     |\n|  56-70 | \"I am the smartest, wisest, strongest, fastest, and most beautiful person I know.\"                                                       |\n|  71-80 | \"I am convinced that powerful enemies are hunting me, and their agents are everywhere I go. I am sure they&apos;re watching me all the time.\" |\n|  81-85 | \"There&apos;s only one person I can trust. And only I can see this special friend.\"                                                           |\n|  86-95 | \"I can&apos;t take anything seriously. The more serious the situation, the funnier I find it.\"                                                |\n| 96-100 | \"I&apos;ve discovered that I really like killing people.\"                                                                                     |\n\n### Curing Madness\n\nA calm emotions spell can suppress the effects of madness, while a lesser restoration spell can rid a character of a short-term or long-term madness. Depending on the source of the madness, [remove curse](spell) or [dispel evil](spell \"dispel evil and good\") might also prove effective. A greater restoration spell or more powerful magic is required to rid a character of indefinite madness.",
        "4. Objects": "# Objects\n\nWhen characters need to saw through ropes, shatter a window, or smash a vampire's coffin, the only hard and fast rule is this: given enough time and the right tools, characters can destroy any destructible object. Use common sense when determining a character's success at damaging an object. Can a fighter cut through a section of a stone wall with a sword? No, the sword is likely to break before the wall does.\n\nFor the purpose of these rules, an object is a discrete, inanimate item like a window, door, sword, book, table, chair, or stone, not a building or a vehicle that is composed of many other objects.\n\n#### Statistics for Objects\n\nWhen time is a factor, you can assign an Armor Class and hit points to a destructible object. You can also give it immunities, resistances, and vulnerabilities to specific types of damage.\n\n***Armor Class.*** An object's Armor Class is a measure of how difficult it is to deal damage to the object when striking it (because the object has no chance of dodging out of the way). The Object Armor Class table provides suggested AC values for various substances.\n\n##### Object Armor Class\n\n| Substance           | AC |\n|---------------------|----|\n| Cloth, paper, rope  | 11 |\n| Crystal, glass, ice | 13 |\n| Wood, bone          | 15 |\n| Stone               | 17 |\n| Iron, steel         | 19 |\n| Mithral             | 21 |\n| Adamantine          | 23 |\n\n***Hit Points.*** An object's hit points measure how much damage it can take before losing its structural integrity. Resilient objects have more hit points than fragile ones. Large objects also tend to have more hit points than small ones, unless breaking a small part of the object is just as effective as breaking the whole thing. The Object Hit Points table provides suggested hit points for fragile and resilient objects that are Large or smaller.\n\n##### Object Hit Points\n\n| Substance           | AC |\n|---------------------|----|\n| Cloth, paper, rope  | 11 |\n| Crystal, glass, ice | 13 |\n| Wood, bone          | 15 |\n| Stone               | 17 |\n| Iron, steel         | 19 |\n| Mithral             | 21 |\n| Adamantine          | 23 |\n\n***Huge and Gargantuan Objects.*** Normal weapons are of little use against many Huge and Gargantuan objects, such as a colossal statue, towering column of stone, or massive boulder. That said, one torch can burn a Huge tapestry, and an  [Earthquake](spell) spell can reduce a colossus to rubble. You can track a Huge or Gargantuan object's hit points if you like, or you can simply decide how long the object can withstand whatever weapon or force is acting against it. If you track hit points for the object, divide it into Large or smaller sections, and track each section's hit points separately. Destroying one of those sections could ruin the entire object. For example, a Gargantuan statue of a human might topple over when one of its Large legs is reduced to 0 hit points.\n\n***Objects and Damage Types.*** Objects are immune to poison and psychic damage. You might decide that some damage types are more effective against a particular object or substance than others. For example, bludgeoning damage works well for smashing things but not for cutting through rope or leather. Paper or cloth objects might be vulnerable to fire and lightning damage. A pick can chip away stone but can't effectively cut down a tree. As always, use your best judgment.\n\n***Damage Threshold.*** Big objects such as castle walls often have extra resilience represented by a damage threshold. An object with a damage threshold has immunity to all damage unless it takes an amount of damage from a single attack or effect equal to or greater than its damage threshold, in which case it takes damage as normal. Any damage that fails to meet or exceed the object's damage threshold is considered superficial and doesn't reduce the object's hit points.",
        "5. Poisons": "# Poisons\n\nGiven their insidious and deadly nature, poisons are illegal in most societies but are a favorite tool among assassins, drow, and other evil creatures.\n\nPoisons come in the following four types.\n\n**Contact.** Contact poison can be smeared on an object and remains potent until it is touched or washed off. A creature that touches contact poison with exposed skin suffers its effects.\n\n**Ingested.** A creature must swallow an entire dose of ingested poison to suffer its effects. The dose can be delivered in food or a liquid. You may decide that a partial dose has a reduced effect, such as allowing advantage on the saving throw or dealing only half damage on a failed save.\n\n**Inhaled.** These poisons are powders or gases that take effect when inhaled. Blowing the powder or releasing the gas subjects creatures in a 5-foot cube to its effect. The resulting cloud dissipates immediately afterward. Holding one's breath is ineffective against inhaled poisons, as they affect nasal membranes, tear ducts, and other parts of the body.\n\n**Injury.** Injury poison can be applied to weapons, ammunition, trap components, and other objects that deal piercing or slashing damage and remains potent until delivered through a wound or washed off. A creature that takes piercing or slashing damage from an object coated with the poison is exposed to its effects.\n\n##### Poisons\n\n| Item               | Type     | Price per Dose |\n|--------------------|----------|----------------|\n| Assassin's blood   | Ingested | 150 gp         |\n| Burnt othur fumes  | Inhaled  | 500 gp         |\n| Crawler mucus      | Contact  | 200 gp         |\n| Drow poison        | Injury   | 200 gp         |\n| Essence of ether   | Inhaled  | 300 gp         |\n| Malice             | Inhaled  | 250 gp         |\n| Midnight tears     | Ingested | 1,500 gp       |\n| Oil of taggit      | Contact  | 400 gp         |\n| Pale tincture      | Ingested | 250 gp         |\n| Purple worm poison | Injury   | 2,000 gp       |\n| Serpent venom      | Injury   | 200 gp         |\n| Torpor             | Ingested | 600 gp         |\n| Truth serum        | Ingested | 150 gp         |\n| Wyvern poison      | Injury   | 1,200 gp       |\n\n### Sample Poisons\n\nEach type of poison has its own debilitating effects.\n\n***Assassin's Blood (Ingested).*** A creature subjected to this poison must make a DC 10 Constitution saving throw. On a failed save, it takes 6 (1d12) poison damage and is poisoned for 24 hours. On a successful save, the creature takes half damage and isn't poisoned.\n\n***Burnt Othur Fumes (Inhaled).*** A creature subjected to this poison must succeed on a DC 13 Constitution saving throw or take 10 (3d6) poison damage, and must repeat the saving throw at the start of each of its turns. On each successive failed save, the character takes 3 (1d6) poison damage. After three successful saves, the poison ends.\n\n***Crawler Mucus (Contact).*** This poison must be harvested from a dead or incapacitated crawler. A creature subjected to this poison must succeed on a DC 13 Constitution saving throw or be poisoned for 1 minute. The poisoned creature is paralyzed. The creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.\n\n***Drow Poison (Injury).*** This poison is typically made only by the drow, and only in a place far removed from sunlight. A creature subjected to this poison must succeed on a DC 13 Constitution saving throw or be poisoned for 1 hour. If the saving throw fails by 5 or more, the creature is also unconscious while poisoned in this way. The creature wakes up if it takes damage or if another creature takes an action to shake it awake.\n\n***Essence of Ether (Inhaled).*** A creature subjected to this poison must succeed on a DC 15 Constitution saving throw or become poisoned for 8 hours. The poisoned creature is unconscious. The creature wakes up if it takes damage or if another creature takes an action to shake it awake.\n\n***Malice (Inhaled).*** A creature subjected to this poison must succeed on a DC 15 Constitution saving throw or become poisoned for 1 hour. The poisoned creature is blinded.\n\n***Midnight Tears (Ingested).*** A creature that ingests this poison suffers no effect until the stroke of midnight. If the poison has not been neutralized before then, the creature must succeed on a DC 17 Constitution saving throw, taking 31 (9d6) poison damage on a failed save, or half as much damage on a successful one.\n\n***Oil of Taggit (Contact).*** A creature subjected to this poison must succeed on a DC 13 Constitution saving throw or become poisoned for 24 hours. The poisoned creature is unconscious. The creature wakes up if it takes damage.\n\n***Pale Tincture (Ingested).*** A creature subjected to this poison must succeed on a DC 16 Constitution saving throw or take 3 (1d6) poison damage and become poisoned. The poisoned creature must repeat the saving throw every 24 hours, taking 3 (1d6) poison damage on a failed save. Until this poison ends, the damage the poison deals can't be healed by any means. After seven successful saving throws, the effect ends and the creature can heal normally.\n\n***Purple Worm Poison (Injury).*** This poison must be harvested from a dead or incapacitated purple worm. A creature subjected to this poison must make a DC 19 Constitution saving throw, taking 42 (12d6) poison damage on a failed save, or half as much damage on a successful one.\n\n***Serpent Venom (Injury).*** This poison must be harvested from a dead or incapacitated giant poisonous snake. A creature subjected to this poison must succeed on a DC 11 Constitution saving throw, taking 10 (3d6) poison damage on a failed save, or half as much damage on a successful one.\n\n***Torpor (Ingested).*** A creature subjected to this poison must succeed on a DC 15 Constitution saving throw or become poisoned for 4d6 hours. The poisoned creature is incapacitated.\n\n***Truth Serum (Ingested).*** A creature subjected to this poison must succeed on a DC 11 Constitution saving throw or become poisoned for 1 hour. The poisoned creature can't knowingly speak a lie, as if under the effect of a zone of truth spell.\n\n***Wyvern Poison (Injury).*** This poison must be harvested from a dead or incapacitated wyvern. A creature subjected to this poison must make a DC 15 Constitution saving throw, taking 24 (7d6) poison damage on a failed save, or half as much damage on a successful one.",
        "6b. Magic Items A-Z": "# Magic Items A-Z\n\nMagic items are presented in alphabetical order. A magic item's description gives the item's name, its category, its rarity, and its magical properties.\n\n[r:function.EvalMacro(\"Magic Items@Lib:Tables\",\"\")]",
        "7a. Monsters": "# Monsters\n\nA monster's statistics, sometimes referred to as its stat block, provide the essential information that you need to run the monster.\n\n### Size\n\nA monster can be Tiny, Small, Medium, Large, Huge, or Gargantuan. The Size Categories table shows how much space a creature of a particular size controls in combat. See the Player's Handbook for more information on creature size and space.\n\n##### Size Categories\n\n| Size       | Space                  | Examples            |\n|------------|------------------------|---------------------|\n| Tiny       | 2½ by 2½ ft.           | Imp, sprite         |\n| Small      | 5 by 5 ft.             | Giant rat, goblin   |\n| Medium     | 5 by 5 ft.             | Orc, werewolf       |\n| Large      | 10 by 10 ft.           | Hippogriff, ogre    |\n| Huge       | 15 by 15 ft.           | Fire giant, treant  |\n| Gargantuan | 20 by 20 ft. or larger | Kraken, purple worm |\n\n```\n\n##### Modifying Creatures\n\nDespite the versatile collection of monsters in this book, you might be at a loss when it comes to finding the perfect creature for part of an adventure. Feel free to tweak an existing creature to make it into something more useful for you, perhaps by borrowing a trait or two from a different monster or by using a **variant** or **template**, such as the ones in this book. Keep in mind that modifying a monster, including when you apply a template to it, might change its challenge rating.\n\n```\n\n### Type\n\nA monster's type speaks to its fundamental nature. Certain spells, magic items, class features, and other effects in the game interact in special ways with creatures of a particular type. For example, an *arrow of dragon slaying* deals extra damage not only to dragons but also other creatures of the dragon type, such as dragon turtles and wyverns.\n\nThe game includes the following monster types, which have no rules of their own.\n\n**Aberrations** are utterly alien beings. Many of them have innate magical abilities drawn from the creature's alien mind rather than the mystical forces of the world. The quintessential aberrations are aboleths, beholders, mind flayers, and slaadi.\n\n**Beasts** are nonhumanoid creatures that are a natural part of the fantasy ecology. Some of them have magical powers, but most are unintelligent and lack any society or language. Beasts include all varieties of ordinary animals, dinosaurs, and giant versions of animals.\n\n**Celestials** are creatures native to the Upper Planes. Many of them are the servants of deities, employed as messengers or agents in the mortal realm and throughout the planes. Celestials are good by nature, so the exceptional celestial who strays from a good alignment is a horrifying rarity. Celestials include angels, couatls, and pegasi.\n\n**Constructs** are made, not born. Some are programmed by their creators to follow a simple set of instructions, while others are imbued with sentience and capable of independent thought. Golems are the iconic constructs. Many creatures native to the outer plane of Mechanus, such as modrons, are constructs shaped from the raw material of the plane by the will of more powerful creatures.\n\n**Dragons** are large reptilian creatures of ancient origin and tremendous power. True dragons, including the good metallic dragons and the evil chromatic dragons, are highly intelligent and have innate magic. Also in this category are creatures distantly related to true dragons, but less powerful, less intelligent, and less magical, such as wyverns and pseudodragons.\n\n**Elementals** are creatures native to the elemental planes. Some creatures of this type are little more than animate masses of their respective elements, including the creatures simply called elementals. Others have biological forms infused with elemental energy. The races of genies, including djinn and efreet, form the most important civilizations on the elemental planes. Other elemental creatures include azers and invisible stalkers.\n\n**Fey** are magical creatures closely tied to the forces of nature. They dwell in twilight groves and misty forests. In some worlds, they are closely tied to the Feywild, also called the Plane of Faerie. Some are also found in the Outer Planes, particularly the planes of Arborea and the Beastlands. Fey include dryads, pixies, and satyrs.\n\n**Fiends** are creatures of wickedness that are native to the Lower Planes. A few are the servants of deities, but many more labor under the leadership of archdevils and demon princes. Evil priests and mages sometimes summon fiends to the material world to do their bidding. If an evil celestial is a rarity, a good fiend is almost inconceivable. Fiends include demons, devils, hell hounds, rakshasas, and yugoloths.\n\n**Giants** tower over humans and their kind. They are humanlike in shape, though some have multiple heads (ettins) or deformities (fomorians). The six varieties of true giant are hill giants, stone giants, frost giants, fire giants, cloud giants, and storm giants. Besides these, creatures such as ogres and trolls are giants.\n\n**Humanoids** are the main peoples of a fantasy gaming world, both civilized and savage, including humans and a tremendous variety of other species. They have language and culture, few if any innate magical abilities (though most humanoids can learn spellcasting), and a bipedal form. The most common humanoid races are the ones most suitable as player characters: humans, dwarves, elves, and halflings. Almost as numerous but far more savage and brutal, and almost uniformly evil, are the races of goblinoids (goblins, hobgoblins, and bugbears), orcs, gnolls, lizardfolk, and kobolds.\n\n**Monstrosities** are monsters in the strictest sense—frightening creatures that are not ordinary, not truly natural, and almost never benign. Some are the results of magical experimentation gone awry (such as owlbears), and others are the product of terrible curses (including minotaurs and yuan-ti). They defy categorization, and in some sense serve as a catch-all category for creatures that don't fit into any other type.\n\n**Oozes** are gelatinous creatures that rarely have a fixed shape. They are mostly subterranean, dwelling in caves and dungeons and feeding on refuse, carrion, or creatures unlucky enough to get in their way. Black puddings and gelatinous cubes are among the most recognizable oozes.\n\n**Plants** in this context are vegetable creatures, not ordinary flora. Most of them are ambulatory, and some are carnivorous. The quintessential plants are the shambling mound and the treant. Fungal creatures such as the gas spore and the myconid also fall into this category.\n\n**Undead** are once-living creatures brought to a horrifying state of undeath through the practice of necromantic magic or some unholy curse. Undead include walking corpses, such as vampires and zombies, as well as bodiless spirits, such as ghosts and specters.\n\n#### Tags\n\nA monster might have one or more tags appended to its type, in parentheses. For example, an orc has the *humanoid (orc)* type. The parenthetical tags provide additional categorization for certain creatures. The tags have no rules of their own, but something in the game, such as a magic item, might refer to them. For instance, a spear that is especially effective at fighting demons would work against any monster that has the demon tag.\n\n### Alignment\n\nA monster's alignment provides a clue to its disposition and how it behaves in a roleplaying or combat situation. For example, a chaotic evil monster might be difficult to reason with and might attack characters on sight, whereas a neutral monster might be willing to negotiate. See the *Player's Handbook* for descriptions of the different alignments.\n\nThe alignment specified in a monster's stat block is the default. Feel free to depart from it and change a monster's alignment to suit the needs of your campaign. If you want a good-aligned green dragon or an evil storm giant, there's nothing stopping you.\n\nSome creatures can have **any alignment**. In other words, you choose the monster's alignment. Some monster's alignment entry indicates a tendency or aversion toward law, chaos, good, or evil. For example, a berserker can be any chaotic alignment (chaotic good, chaotic neutral, or chaotic evil), as befits its wild nature.\n\nMany creatures of low intelligence have no comprehension of law or chaos, good or evil. They don't make moral or ethical choices, but rather act on instinct. These creatures are **unaligned**, which means they don't have an alignment.\n\n### Armor Class\n\nA monster that wears armor or carries a shield has an Armor Class (AC) that takes its armor, shield, and Dexterity into account. Otherwise, a monster's AC is based on its Dexterity modifier and natural armor, if any. If a monster has natural armor, wears armor, or carries a shield, this is noted in parentheses after its AC value.\n\n### Hit Points\n\nA monster usually dies or is destroyed when it drops to 0 hit points. For more on hit points, see the *Player's Handbook.*\n\nA monster's hit points are presented both as a die expression and as an average number. For example, a monster with 2d8 hit points has 9 hit points on average (2 × 4½).\n\nA monster's size determines the die used to calculate its hit points, as shown in the Hit Dice by Size table.\n\n##### Hit Dice by Size\n\n| Monster Size | Hit Die | Average HP per Die |\n|--------------|---------|--------------------|\n| Tiny         | d4      | 2½                 |\n| Small        | d6      | 3½                 |\n| Medium       | d8      | 4½                 |\n| Large        | d10     | 5½                 |\n| Huge         | d12     | 6½                 |\n| Gargantuan   | d20     | 10½                |\n\nA monster's Constitution modifier also affects the number of hit points it has. Its Constitution modifier is multiplied by the number of Hit Dice it possesses, and the result is added to its hit points. For example, if a monster has a Constitution of 12 (+1 modifier) and 2d8 Hit Dice, it has 2d8 + 2 hit points (average 11).\n\n### Speed\n\nA monster's speed tells you how far it can move on its turn. For more information on speed, see the *Player's Handbook*.\n\nAll creatures have a walking speed, simply called the monster's speed. Creatures that have no form of ground-based locomotion have a walking speed of 0 feet.\n\nSome creatures have one or more of the following additional movement modes.\n\n#### Burrow\n\nA monster that has a burrowing speed can use that speed to move through sand, earth, mud, or ice. A monster can't burrow through solid rock unless it has a special trait that allows it to do so.\n\n#### Climb\n\nA monster that has a climbing speed can use all or part of its movement to move on vertical surfaces. The monster doesn't need to spend extra movement to climb.\n\n#### Fly\n\nA monster that has a flying speed can use all or part of its movement to fly. Some monsters have the ability to **hover**, which makes them hard to knock out of the air (as explained in the rules on flying in the *Player's Handbook*). Such a monster stops hovering when it dies.\n\n#### Swim\n\nA monster that has a swimming speed doesn't need to spend extra movement to swim.\n\n### Ability Scores\n\nEvery monster has six ability scores (Strength, Dexterity, Constitution, Intelligence, Wisdom, and Charisma) and corresponding modifiers. For more information on ability scores and how they're used in play, see the *Player's Handbook*.\n\n### Saving Throws\n\nThe Saving Throws entry is reserved for creatures that are adept at resisting certain kinds of effects. For example, a creature that isn't easily charmed or frightened might gain a bonus on its Wisdom saving throws. Most creatures don't have special saving throw bonuses, in which case this section is absent.\n\nA saving throw bonus is the sum of a monster's relevant ability modifier and its proficiency bonus, which is determined by the monster's challenge rating (as shown in the Proficiency Bonus by Challenge Rating table).\n\n##### Proficiency Bonus by Challenge Rating\n\n| Challenge | Proficiency Bonus |\n|-----------|-------------------|\n| 0         | + 2               |\n| 1/8       | + 2               |\n| 1/4       | + 2               |\n| 1/2       | + 2               |\n| 1         | + 2               |\n| 2         | + 2               |\n| 3         | + 2               |\n| 4         | + 2               |\n| 5         | + 3               |\n| 6         | + 3               |\n| 7         | + 3               |\n| 8         | + 3               |\n| 9         | + 4               |\n| 10        | + 4               |\n| 11        | + 4               |\n| 12        | + 4               |\n| 13        | + 5               |\n| 14        | + 5               |\n| 15        | + 5               |\n| 16        | + 5               |\n| 17        | + 6               |\n| 18        | + 6               |\n| 19        | + 6               |\n| 20        | + 6               |\n| 21        | + 7               |\n| 22        | + 7               |\n| 23        | + 7               |\n| 24        | + 7               |\n| 25        | + 8               |\n| 26        | + 8               |\n| 27        | + 8               |\n| 28        | + 8               |\n| 29        | + 9               |\n| 30        | + 9               |\n\n### Skills\n\nThe Skills entry is reserved for monsters that are proficient in one or more skills. For example, a monster that is very perceptive and stealthy might have bonuses to Wisdom (Perception) and Dexterity (Stealth) checks.\n\nA skill bonus is the sum of a monster's relevant ability modifier and its proficiency bonus, which is determined by the monster's challenge rating (as shown in the Proficiency Bonus by Challenge Rating table). Other modifiers might apply. For instance, a monster might have a larger-than-expected bonus (usually double its proficiency bonus) to account for its heightened expertise.\n\n```\n\n##### Armor, Weapon, and Tool Proficiencies\n\nAssume that a creature is proficient with its armor, weapons, and tools. If you swap them out, you decide whether the creature is proficient with its new equipment.\n\nFor example, a hill giant typically wears hide armor and wields a greatclub. You could equip a hill giant with chain mail and a greataxe instead, and assume the giant is proficient with both, one or the other, or neither.\n\nSee the *Player's Handbook* for rules on using armor or weapons without proficiency.\n\n```\n\n### Vulnerabilities, Resistances, and Immunities\n\nSome creatures have vulnerability, resistance, or immunity to certain types of damage. Particular creatures are even resistant or immune to damage from nonmagical attacks (a magical attack is an attack delivered by a spell, a magic item, or another magical source). In addition, some creatures are immune to certain conditions.\n\n### Senses\n\nThe Senses entry notes a monster's passive Wisdom (Perception) score, as well as any special senses the monster might have. Special senses are described below.\n\n#### Blindsight\n\nA monster with blindsight can perceive its surroundings without relying on sight, within a specific radius.\n\nCreatures without eyes, such as grimlocks and gray oozes, typically have this special sense, as do creatures with echolocation or heightened senses, such as bats and true dragons.\n\nIf a monster is naturally blind, it has a parenthetical note to this effect, indicating that the radius of its blindsight defines the maximum range of its perception.\n\n#### Darkvision\n\nA monster with darkvision can see in the dark within a specific radius. The monster can see in dim light within the radius as if it were bright light, and in darkness as if it were dim light. The monster can't discern color in darkness, only shades of gray. Many creatures that live underground have this special sense.\n\n#### Tremorsense\n\nA monster with tremorsense can detect and pinpoint the origin of vibrations within a specific radius, provided that the monster and the source of the vibrations are in contact with the same ground or substance. Tremorsense can't be used to detect flying or incorporeal creatures. Many burrowing creatures, such as ankhegs and umber hulks, have this special sense.\n\n#### Truesight\n\nA monster with truesight can, out to a specific range, see in normal and magical darkness, see invisible creatures and objects, automatically detect visual illusions and succeed on saving throws against them, and perceive the original form of a shapechanger or a creature that is transformed by magic. Furthermore, the monster can see into the Ethereal Plane within the same range.\n\n### Languages\n\nThe languages that a monster can speak are listed in alphabetical order. Sometimes a monster can understand a language but can't speak it, and this is noted in its entry. A “—” indicates that a creature neither speaks nor understands any language.\n\n#### Telepathy\n\nTelepathy is a magical ability that allows a monster to communicate mentally with another creature within a specified range. The contacted creature doesn't need to share a language with the monster to communicate in this way with it, but it must be able to understand at least one language. A creature without telepathy can receive and respond to telepathic messages but can't initiate or terminate a telepathic conversation.\n\nA telepathic monster doesn't need to see a contacted creature and can end the telepathic contact at any time. The contact is broken as soon as the two creatures are no longer within range of each other or if the telepathic monster contacts a different creature within range. A telepathic monster can initiate or terminate a telepathic conversation without using an action, but while the monster is incapacitated, it can't initiate telepathic contact, and any current contact is terminated.\n\nA creature within the area of an *antimagic field* or in any other location where magic doesn't function can't send or receive telepathic messages.\n\n### Challenge\n\nA monster's **challenge rating** tells you how great a threat the monster is. An appropriately equipped and well-rested party of four adventurers should be able to defeat a monster that has a challenge rating equal to its level without suffering any deaths. For example, a party of four 3rd-level characters should find a monster with a challenge rating of 3 to be a worthy challenge, but not a deadly one.\n\nMonsters that are significantly weaker than 1st-level characters have a challenge rating lower than 1. Monsters with a challenge rating of 0 are insignificant except in large numbers; those with no effective attacks are worth no experience points, while those that have attacks are worth 10 XP each.\n\nSome monsters present a greater challenge than even a typical 20th-level party can handle. These monsters have a challenge rating of 21 or higher and are specifically designed to test player skill.\n\n#### Experience Points\n\nThe number of experience points (XP) a monster is worth is based on its challenge rating. Typically, XP is awarded for defeating the monster, although the GM may also award XP for neutralizing the threat posed by the monster in some other manner.\n\nUnless something tells you otherwise, a monster summoned by a spell or other magical ability is worth the XP noted in its stat block.\n\n##### Experience Points by Challenge Rating\n\n| Challenge | XP      |\n|-----------|---------|\n| 0         | 0 or 10 |\n| 1/8       | 25      |\n| 1/4       | 50      |\n| 1/2       | 100     |\n| 1         | 200     |\n| 2         | 450     |\n| 3         | 700     |\n| 4         | 1,100   |\n| 5         | 1,800   |\n| 6         | 2,300   |\n| 7         | 2,900   |\n| 8         | 3,900   |\n| 9         | 5,000   |\n| 10        | 5,900   |\n| 11        | 7,200   |\n| 12        | 8,400   |\n| 13        | 10,000  |\n| 14        | 11,500  |\n| 15        | 13,000  |\n| 16        | 15,000  |\n| 17        | 18,000  |\n| 18        | 20,000  |\n| 19        | 22,000  |\n| 20        | 25,000  |\n| 21        | 33,000  |\n| 22        | 41,000  |\n| 23        | 50,000  |\n| 24        | 62,000  |\n| 25        | 75,000  |\n| 26        | 90,000  |\n| 27        | 105,000 |\n| 28        | 120,000 |\n| 29        | 135,000 |\n| 30        | 155,000 |\n\n### Special Traits\n\nSpecial traits (which appear after a monster's challenge rating but before any actions or reactions) are characteristics that are likely to be relevant in a combat encounter and that require some explanation.\n\n#### Innate Spellcasting\n\nA monster with the innate ability to cast spells has the Innate Spellcasting special trait. Unless noted otherwise, an innate spell of 1st level or higher is always cast at its lowest possible level and can't be cast at a higher level. If a monster has a cantrip where its level matters and no level is given, use the monster's challenge rating.\n\nAn innate spell can have special rules or restrictions. For example, a drow mage can innately cast the *levitate* spell, but the spell has a “self only” restriction, which means that the spell affects only the drow mage.\n\nA monster's innate spells can't be swapped out with other spells. If a monster's innate spells don't require attack rolls, no attack bonus is given for them.\n\n#### Spellcasting\n\nA monster with the Spellcasting special trait has a spellcaster level and spell slots, which it uses to cast its spells of 1st level and higher (as explained in the *Player's Handbook*). The spellcaster level is also used for any cantrips included in the feature.\n\nThe monster has a list of spells known or prepared from a specific class. The list might also include spells from a feature in that class, such as the Divine Domain feature of the cleric or the Druid Circle feature of the druid. The monster is considered a member of that class when attuning to or using a magic item that requires membership in the class or access to its spell list.\n\nA monster can cast a spell from its list at a higher level if it has the spell slot to do so. For example, a drow mage with the 3rd-level *lightning bolt* spell can cast it as a 5th-level spell by using one of its 5th-level spell slots.\n\nYou can change the spells that a monster knows or has prepared, replacing any spell on its spell list with a spell of the same level and from the same class list. If you do so, you might cause the monster to be a greater or lesser threat than suggested by its challenge rating\n\n#### Psionics\n\nA monster that casts spells using only the power of its mind has the psionics tag added to its Spellcasting or Innate Spellcasting special trait. This tag carries no special rules of its own, but other parts of the game might refer to it. A monster that has this tag typically doesn't require any components to cast its spells.\n\n### Actions\n\nWhen a monster takes its action, it can choose from the options in the Actions section of its stat block or use one of the actions available to all creatures, such as the Dash or Hide action, as described in the *Player's Handbook*.\n\n#### Melee and Ranged Attacks\n\nThe most common actions that a monster will take in combat are melee and ranged attacks. These can be spell attacks or weapon attacks, where the “weapon” might be a manufactured item or a natural weapon, such as a claw or tail spike. For more information on different kinds of attacks, see the *Player's Handbook*.\n\n**Creature vs. Target.** The target of a melee or ranged attack is usually either one creature or one target, the difference being that a “target” can be a creature or an object.\n\n**Hit.** Any damage dealt or other effects that occur as a result of an attack hitting a target are described after the “Hit” notation. You have the option of taking average damage or rolling the damage; for this reason, both the average damage and the die expression are presented.\n\n**Miss.** If an attack has an effect that occurs on a miss, that information is presented after the “Miss:” notation.\n\n#### Multiattack\n\nA creature that can make multiple attacks on its turn has the Multiattack action. A creature can't use Multiattack when making an opportunity attack, which must be a single melee attack.\n\n#### Ammunition\n\nA monster carries enough ammunition to make its ranged attacks. You can assume that a monster has 2d4 pieces of ammunition for a thrown weapon attack, and 2d10 pieces of ammunition for a projectile weapon such as a bow or crossbow.\n\n### Reactions\n\nIf a monster can do something special with its reaction, that information is contained here. If a creature has no special reaction, this section is absent.\n\n## Limited Usage\n\nSome special abilities have restrictions on the number of times they can be used.\n\n**X/Day.** The notation “X/Day” means a special ability can be used X number of times and that a monster must finish a long rest to regain expended uses. For example, “1/Day” means a special ability can be used once and that the monster must finish a long rest to use it again.\n\n**Recharge X–Y.** The notation “Recharge X–Y” means a monster can use a special ability once and that the ability then has a random chance of recharging during each subsequent round of combat. At the start of each of the monster's turns, roll a d6. If the roll is one of the numbers in the recharge notation, the monster regains the use of the special ability. The ability also recharges when the monster finishes a short or long rest.\n\nFor example, “Recharge 5–6” means a monster can use the special ability once. Then, at the start of the monster's turn, it regains the use of that ability if it rolls a 5 or 6 on a d6.\n\n**Recharge after a Short or Long Rest.** This notation means that a monster can use a special ability once and then must finish a short or long rest to use it again.\n\n```\n\n##### Grapple Rules for Monsters\n\nMany monsters have special attacks that allow them to quickly grapple prey. When a monster hits with such an attack, it doesn't need to make an additional ability check to determine whether the grapple succeeds, unless the attack says otherwise.\n\nA creature grappled by the monster can use its action to try to escape. To do so, it must succeed on a Strength (Athletics) or Dexterity (Acrobatics) check against the escape DC in the monster's stat block. If no escape DC is given, assume the DC is 10 + the monster's Strength (Athletics) modifier.\n\n```\n\n### Equipment\n\nA stat block rarely refers to equipment, other than armor or weapons used by a monster. A creature that customarily wears clothes, such as a humanoid, is assumed to be dressed appropriately.\n\nYou can equip monsters with additional gear and trinkets however you like, and you decide how much of a monster's equipment is recoverable after the creature is slain and whether any of that equipment is still usable. A battered suit of armor made for a monster is rarely usable by someone else, for instance.\n\nIf a spellcasting monster needs material components to cast its spells, assume that it has the material components it needs to cast the spells in its stat block.",
        "6a. Magic Items": "# Magic Items\n\nMagic items are gleaned from the hoards of conquered monsters or discovered in long-lost vaults. Such items grant capabilities a character could rarely have otherwise, or they complement their owner's capabilities in wondrous ways.\n\n## Attunement\n\nSome magic items require a creature to form a bond with them before their magical properties can be used. This bond is called attunement, and certain items have a prerequisite for it. If the prerequisite is a class, a creature must be a member of that class to attune to the item. (If the class is a spellcasting class, a monster qualifies if it has spell slots and uses that class's spell list.) If the prerequisite is to be a spellcaster, a creature qualifies if it can cast at least one spell using its traits or features, not using a magic item or the like.\n\nWithout becoming attuned to an item that requires attunement, a creature gains only its nonmagical benefits, unless its description states otherwise. For example, a magic shield that requires attunement provides the benefits of a normal shield to a creature not attuned to it, but none of its magical properties.\n\nAttuning to an item requires a creature to spend a short rest focused on only that item while being in physical contact with it (this can't be the same short rest used to learn the item's properties). This focus can take the form of weapon practice (for a weapon), meditation (for a wondrous item), or some other appropriate activity. If the short rest is interrupted, the attunement attempt fails. Otherwise, at the end of the short rest, the creature gains an intuitive understanding of how to activate any magical properties of the item, including any necessary command words.\n\nAn item can be attuned to only one creature at a time, and a creature can be attuned to no more than three magic items at a time. Any attempt to attune to a fourth item fails; the creature must end its attunement to an item first. Additionally, a creature can't attune to more than one copy of an item. For example, a creature can't attune to more than one *ring of protection* at a time.\n\nA creature's attunement to an item ends if the creature no longer satisfies the prerequisites for attunement, if the item has been more than 100 feet away for at least 24 hours, if the creature dies, or if another creature attunes to the item. A creature can also voluntarily end attunement by spending another short rest focused on the item, unless the item is cursed.\n\n# Wearing and Wielding Items\n\nUsing a magic item's properties might mean wearing or wielding it. A magic item meant to be worn must be donned in the intended fashion: boots go on the feet, gloves on the hands, hats and helmets on the head, and rings on the finger. Magic armor must be donned, a shield strapped to the arm, a cloak fastened about the shoulders. A weapon must be held.\n\nIn most cases, a magic item that's meant to be worn can fit a creature regardless of size or build. Many magic garments are made to be easily adjustable, or they magically adjust themselves to the wearer. Rare exceptions exist. If the story suggests a good reason for an item to fit only creatures of a certain size or shape, you can rule that it doesn't adjust. For example, drow-made armor might fit elves only. Dwarves might make items usable only by dwarf-sized and dwarf-shaped folk.\n\nWhen a nonhumanoid tries to wear an item, use your discretion as to whether the item functions as intended. A ring placed on a tentacle might work, but a yuan-ti with a snakelike tail instead of legs can't wear boots.\n\n### Multiple Items of the Same Kind\n\nUse common sense to determine whether more than one of a given kind of magic item can be worn. A character can't normally wear more than one pair of footwear, one pair of gloves or gauntlets, one pair of bracers, one suit of armor, one item of headwear, and one cloak. You can make exceptions; a character might be able to wear a circlet under a helmet, for example, or to layer two cloaks.\n\n### Paired Items\n\nItems that come in pairs—such as boots, bracers, gauntlets, and gloves—impart their benefits only if both items of the pair are worn. For example, a character wearing a boot of striding and springing on one foot and a boot of elvenkind on the other foot gains no benefit from either.\n\n# Activating an Item\n\nActivating some magic items requires a user to do something special, such as holding the item and uttering a command word. The description of each item category or individual item details how an item is activated. Certain items use the following rules for their activation.\n\nIf an item requires an action to activate, that action isn't a function of the Use an Item action, so a feature such as the rogue's Fast Hands can't be used to activate the item.\n\n### Command Word\n\nA command word is a word or phrase that must be spoken for an item to work. A magic item that requires a command word can't be activated in an area where sound is prevented, as in the area of the silence spell.\n\n### Consumables\n\nSome items are used up when they are activated. A potion or an elixir must be swallowed, or an oil applied to the body. The writing vanishes from a scroll when it is read. Once used, a consumable item loses its magic.\n\n### Spells\n\nSome magic items allow the user to cast a spell from the item. The spell is cast at the lowest possible spell level, doesn't expend any of the user's spell slots, and requires no components, unless the item's description says otherwise. The spell uses its normal casting time, range, and duration, and the user of the item must concentrate if the spell requires concentration. Many items, such as potions, bypass the casting of a spell and confer the spell's effects, with their usual duration. Certain items make exceptions to these rules, changing the casting time, duration, or other parts of a spell.\n\nA magic item, such as certain staffs, may require you to use your own spellcasting ability when you cast a spell from the item. If you have more than one spellcasting ability, you choose which one to use with the item. If you don't have a spellcasting ability—perhaps you're a rogue with the Use Magic Device feature—your spellcasting ability modifier is +0 for the item, and your proficiency bonus does apply.\n\n### Charges\n\nSome magic items have charges that must be expended to activate their properties. The number of charges an item has remaining is revealed when an identify spell is cast on it, as well as when a creature attunes to it. Additionally, when an item regains charges, the creature attuned to it learns how many charges it regained.\n\n## Sentient Magic Items\n\nSome magic items possess sentience and personality. Such an item might be possessed, haunted by the spirit of a previous owner, or self-aware thanks to the magic used to create it. In any case, the item behaves like a character, complete with personality quirks, ideals, bonds, and sometimes flaws. A sentient item might be a cherished ally to its wielder or a continual thorn in the side.\n\nMost sentient items are weapons. Other kinds of items can manifest sentience, but consumable items such as potions and scrolls are never sentient.\n\nSentient magic items function as NPCs under the GM's control. Any activated property of the item is under the item's control, not its wielder's. As long as the wielder maintains a good relationship with the item, the wielder can access those properties normally. If the relationship is strained, the item can suppress its activated properties or even turn them against the wielder.\n\n### Creating Sentient Magic Items\n\nWhen you decide to make a magic item sentient, you create the item's persona in the same way you would create an NPC, with a few exceptions described here.\n\n#### Abilities\n\nA sentient magic item has Intelligence, Wisdom, and Charisma scores. You can choose the item's abilities or determine them randomly. To determine them randomly, roll 4d6 for each one, dropping the lowest roll and totaling the rest.\n\n#### Communication\n\nA sentient item has some ability to communicate, either by sharing its emotions, broadcasting its thoughts telepathically, or speaking aloud. You can choose how it communicates or roll on the following table.\n\n| d100  | Communication                                                                                                                                                      |\n|-------|--------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| 01–60 | The item communicates by transmitting emotion to the creature carrying or wielding it.                                                                             |\n| 61–90 | The item can speak, read, and understand one or more languages.                                                                                                    |\n| 91–00 | The item can speak, read, and understand one or more languages. In addition, the item can communicate telepathically with any character that carries or wields it. |\n\n#### Senses\n\nWith sentience comes awareness. A sentient item can perceive its surroundings out to a limited range. You can choose its senses or roll on the following table.\n\n| d4 | Senses                                     |\n|----|--------------------------------------------|\n| 1  | Hearing and normal vision out to 30 feet.  |\n| 2  | Hearing and normal vision out to 60 feet   |\n| 3  | Hearing and normal vision out to 120 feet. |\n| 4  | Hearing and darkvision out to 120 feet.    |\n\n#### Alignment\n\nA sentient magic item has an alignment. Its creator or nature might suggest an alignment. If not, you can pick an alignment or roll on the following table.\n\n| d100  | Alignment       |\n|-------|-----------------|\n| 01–15 | Lawful good     |\n| 16–35 | Neutral good    |\n| 36–50 | Chaotic good    |\n| 51–63 | Lawful neutral  |\n| 64–73 | Neutral         |\n| 74–85 | Chaotic neutral |\n| 86–89 | Lawful evil     |\n| 90–96 | Neutral evil    |\n| 97–00 | Chaotic evil    |\n\n#### Special Purpose\n\nYou can give a sentient item an objective it pursues, perhaps to the exclusion of all else. As long as the wielder's use of the item aligns with that special purpose, the item remains cooperative. Deviating from this course might cause conflict between the wielder and the item, and could even cause the item to prevent the use of its activated properties. You can pick a special purpose or roll on the following table.\n\n| d10 | Purpose                                                                                                                                |\n|-----|----------------------------------------------------------------------------------------------------------------------------------------|\n| 1   | Aligned: The item seeks to defeat or destroy those of a diametrically opposed alignment. (Such an item is never neutral.)              |\n| 2   | Bane: The item seeks to defeat or destroy creatures of a particular kind, such as fiends, shapechangers, trolls, or wizards.           |\n| 3   | Protector: The item seeks to defend a particular race or kind of creature, such as elves or druids.                                    |\n| 4   | Crusader: The item seeks to defeat, weaken, or destroy the servants of a particular deity.                                             |\n| 5   | Templar: The item seeks to defend the servants and interests of a particular deity.                                                    |\n| 6   | Destroyer: The item craves destruction and goads its user to fight arbitrarily.                                                        |\n| 7   | Glory Seeker: The item seeks renown as the greatest magic item in the world, by establishing its user as a famous or notorious figure. |\n| 8   | Lore Seeker: The item craves knowledge or is determined to solve a mystery, learn a secret, or unravel a cryptic prophecy.             |\n| 9   | Destiny Seeker: The item is convinced that it and its wielder have key roles to play in future events.                                 |\n| 10  | Creator Seeker: The item seeks its creator and wants to understand why it was created.                                                 |\n\n### Conflict\n\nA sentient item has a will of its own, shaped by its personality and alignment. If its wielder acts in a manner opposed to the item's alignment or purpose, conflict can arise. When such a conflict occurs, the item makes a Charisma check contested by the wielder's Charisma check. If the item wins the contest, it makes one or more of the following demands:\n\n- The item insists on being carried or worn at all times.\n- The item demands that its wielder dispose of anything the item finds repugnant.\n- The item demands that its wielder pursue the item's goals to the exclusion of all other goals.\n- The item demands to be given to someone else.\n\nIf its wielder refuses to comply with the item's wishes, the item can do any or all of the following: \n\n- Make it impossible for its wielder to attune to it.\n- Suppress one or more of its activated properties.\n- Attempt to take control of its wielder.\n\nIf a sentient item attempts to take control of its wielder, the wielder must make a Charisma saving throw, with a DC equal to 12 + the item's Charisma modifier. On a failed save, the wielder is charmed by the item for 1d12 hours. While charmed, the wielder must try to follow the item's commands. If the wielder takes damage, it can repeat the saving throw, ending the effect on a success. Whether the attempt to control its user succeeds or fails, the item can't use this power again until the next dawn.",
        "7b. Legendary Creatures": "# Legendary Creatures\n\nA legendary creature can do things that ordinary creatures can't. It can take special actions outside its turn, and it might exert magical influence for miles around.\n\nIf a creature assumes the form of a legendary creature, such as through a spell, it doesn't gain that form's legendary actions, lair actions, or regional effects.\n\n### Legendary Actions\n\nA legendary creature can take a certain number of special actions—called legendary actions—outside its turn. Only one legendary action option can be used at a time and only at the end of another creature's turn. A creature regains its spent legendary actions at the start of its turn. It can forgo using them, and it can't use them while incapacitated or otherwise unable to take actions. If surprised, it can't use them until after its first turn in the combat.\n\n### A Legendary Creature's Lair\n\nA legendary creature might have a section describing its lair and the special effects it can create while there, either by act of will or simply by being present. Such a section applies only to a legendary creature that spends a great deal of time in its lair.\n\n#### Lair Actions\n\nIf a legendary creature has lair actions, it can use them to harness the ambient magic in its lair. On initiative count 20 (losing all initiative ties), it can use one of its lair action options. It can't do so while incapacitated or otherwise unable to take actions. If surprised, it can't use one until after its first turn in the combat.\n\n#### Regional Effects\n\nThe mere presence of a legendary creature can have strange and wondrous effects on its environment, as noted in this section. Regional effects end abruptly or dissipate over time when the legendary creature dies.",
        "7c. Monsters A-Z": "# Monsters A-Z\n\n[r:macroLink(\"Table of Monsters\",\"Creature Window@Lib:Tables\",\"\")]"
    }
}