{
    "settings": {
        "theme": "GitHub",
        "label": "red",
        "ChaNumber": 1
    },
    "content": {
        "1. Getting Started": "# 1. Getting Started\n\nWelcome to this **D&amp;D 5e Framework**, and thanks for trying it! This notebook will teach the basics on how to use the framework. For more information about the framework, you can visit the [Wiki](https://github.com/rtakehara/5e-Framework/wiki), For tutorials on how to use **MapTool**, check their [page](https://www.rptools.net/tutorials/), and for more information on how to play **D&amp;D 5e**, you can get the **Basic Rules** for free at their [resources](https://dnd.wizards.com/products/tabletop-games/trpg-resources) section.\n\n### Interface Setup\n\nYou can set up your interface any way you prefer, but I recommend you set yours as the following:\n\n![Layout](https://i.imgur.com/5RjcszZ.png)\n\n## 1. Campaign Window\n\nThe campaign window contains macros to open the most important menus and dice rolls. The keyboard shortcuts will not register if the campaign window is inactive, so leave the campaign frame open at all times, even if retracted. Most campaign macros can be accessed from the Mini Menu Overlay.\n\nTo ensure you have the campaign window open in MapTool, find the top row of menus in MapTool and select \"Windows\", or use the keyboard shortcut alt+w. In that menu, ensure that \"Campaign\" has a checkmark next to it. If there is no checkmark, click on \"Campaign\" and the window should show up within MapTool. \n\n## 2. Statblock Windows\n\nStatblocks serve as a summary of stats for each monster and character. NPCs only have statblocks; PCs have a character sheet and more functionality built out (to be discussed later), but can see a summary of their stats and abilities in a statblock window as well. You can use the statblocks to keep your character and/or monster details open and tabbed on one side of the screen for easy access. \n\nTo open a statblock window for an already-created NPC or PC (creation covered elsewhere): \n\n1. Click on the \"Windows\" menu at the top of MapTool. \n2. Ensure that the \"Selection\" window is checked off, and if not, click on \"Selection\" to view that window. \n3. Select the token that you wish to see a statblock for. \n4. In the selection pane for that token, select the \"Statblock\" button to show the Statblock window. \n\n## 3. Chat and other frames\n\nKeep the Chat and optionally other frames like the Compendium, GM, Selected and Library frames tabbed on one side of the screen.\n\nThe Chat is where all dice rolls will be output, as well as other messages and possibly chat, and the Compendium displays and organizes almost everything in the framework, characters, equipment, classes, features, tables, notebooks...\n\n## 4. Initiative Tracker Overlay\n\nThe Initiative tracker replaces the default Initiative frame, simplifying and adding functionality specific to the framework.\n\n## 5. Statsheet\n\nThe statsheet and portrait will display HP, AC, Passive checks and Elevation when you hover your mouse over a token.\n\n## 6. Mini Menu Overlay\n\nThe Mini Menu can be toggled on and off, it displays links to useful menus, functions and features of the framework, and shortcuts to character sheets, various dice rolls, notebooks and help.\n\n## 7. Selected Overlay\n\nThe selected overlay display the image of the selected token, all it&apos;s macros on the right, and other utility tools on the right. If you select two tokens, it will display the distance between them.\n\nThe utility tools include interacting with an object, setting elevation, visibility and light and many others.",
        "2. The Framework Menu": "# 2. The Framework Menu\n\nOn the top left of the map area, you will see the **Framework Menu**. It can be toggled on or off using the ![](asset://8e20eb965fbde14b61740130fba25650=20) button.\n\nThese options are common to the **DM** and the **Players**.\n\n### Compendium ![](asset://aed6269a99576e707a8b2e5081a11fed=20)\n\nThis option opens a window with organized content of most of the framework resources, such as classes, races, backgrounds, feats, class spells, bestiary and rollable tables.\n\nPlayers can use these options to create, level up and plan their characters, as it shows all character features as well as provides links to copy each feature to the character sheet.\n\n### Search tools ![](asset://8aa28b1474dd5f3031536499843264d9=20)\n\nYou can [r:macroLink(\"search\",\"Search@Lib:Campaign\")] for various things such as *item*, *spell*, *feature*, *character*, *note*, *image token* and many more, loaded in the Framework by clicking in search button or the shortcut **F11** by default.\n\nto search, any lenght of the name will work, for images, the exact name (sans the \"image:\" part) must be written.\n\n[![search window](https://i.imgur.com/btUvuTu.png=400)](https://i.imgur.com/btUvuTu.png)\n\nThe results are links that will open a pop up window with information about that object, an item, feature and spell can be moved (clicking on the **Move** link) to a character, and a monster can be placed on the map, invisible to the players. All results can be shared.\n\n### Notebooks ![](asset://b92cef77adaee8657caaed183e14fc90=20)\n\nThis menu will open a submenu with all the notebooks owned by all players, and the ones owned by just you. This means the DM can keep one or more public notebooks for information available for the entire group, such as table rules and campaign journal, and private ones just for you. Be aware that the DM can see your journal.\n\nFrom this menu you can also create a new journal, just select a token that you own and is set as NPC, and click the **New Notebook** Button, more on [notebooks](note \"7. Notebooks@Welcome\") later.\n\n### Player Menu ![](asset://c45d03178fc81ee6a43b09f9e995555f=20)\n\nThe player menu displays links to character creation, character sheets and the language window, more on the [player menu](note \"3. The Player Menu\") later.\n\n### GM Menu ![](asset://22e15a9afb193fd2681f3df274d6c791=20)\n\nThe GM menu displays links to Party and Encounter manager, Pin settings, requesting rolls for players, NPC creation and the framework settings. more on the [GM menu](note \"4. The GM Menu\") later.\n\n### Initiative ![](asset://9128743dc70d3f19d3b0a06678ffb26a=20)\n\nThe initiative menu opens the initiative overlay and a link to roll initiative.\n\n### Dice Roller ![](asset://274cb2ad110af815ee7c7d5b47989b0b=20)\n\nThe dice roller displays a table with various dice rolls, the dice roller imput, and the GM will have a quick toggle to display or hide future dice rolls.\n\n### Select Map ![](asset://0fcfa25c7bce6c353f089fa6baa111aa=20)\n\nThis option will show and grant access to all maps visible to you, this is the same as the MapTool **Select Map** button on the tool ribbon, but if you want to minimize the ribbon you can still access the maps in this menu. It is also available via the **F10** shortcut by default.\n\nIt also includes a collection of weather effects that can be used to add rain, snow, leaves, fog and time of day effects.\n\n### Help ![](asset://58b0e9a3c305bd28bf35d6d76b5943d0=20)\n\nThe Help menu offers links to the framework&apos;s [wiki](https://github.com/rtakehara/5e-Framework/wiki), the Wizards of the Coast free [Basic Rules](https://media.wizards.com/2018/dnd/downloads/DnD_BasicRules_2018.pdf#page=2) and to the [bug report](https://github.com/rtakehara/5e-Framework/issue) page. If you find a bug, please report it there with detailed informations on how to reproduce the bug.",
        "3. The Player Menu": "# 3. The Player Menu\n\nIf you are a **player**, these options will be available to you.\n\n### Statblock ![](asset://9128743dc70d3f19d3b0a06678ffb26a=20)\n\nThis option will open the character statblock. If you have more than one character, a list will pop up, if you don&apos;t have any, this option will not be visible.\n\n### Character Sheet ![](asset://4625dbf1c172c2408fd3d80692331fc5=20)\n\nThis option will open the main page of the character sheet. If you have more than one character, a list will pop up, if you don&apos;t have any, this option will not be visible.\n\n### Description Sheet ![](asset://b92cef77adaee8657caaed183e14fc90=20)\n\nThis option will open the description page of the character. If you have more than one character, a list will pop up, if you don&apos;t have any, this option will not be visible.\n\n### Spellcasting Sheet ![](asset://aed6269a99576e707a8b2e5081a11fed=20)\n\nThis option will open the Spellcasting page of the character. If you have more than one character, a list will pop up, if you don&apos;t have any, this option will not be visible.\n\n### New PC ![](asset://8a0b10d13b3c5d66ec8a342e1ed4f50e=20)\n\nThis option will set the *selected token* as a *Player Character*, opening the **Character**, **Description** and **Spellcasting** to edit your character, alternatively, you can use the **1st Level** and **Level Up** options to load the **Character Creation Wizard** and let the framework create your character for you.\n\n### 1st Level ![](asset://9431a91860a997a3b66f65bfc5430c11=20)\n\nThis option will load the **Character Creation Wizard**. The wizard will attempt to create your character as you choose your character options. The only options available are the free ones provided by the *Wizards of the Coast*, but your GM can load the rest of them or create new ones.\n\n[![wizard](https://i.imgur.com/IYkXTnw.png=400)](https://i.imgur.com/IYkXTnw.png)\n\nTo create a character with the wizard, you must be in a map with a token you own and is set as PC, follow the step by step, reading the instructions until the end. You can also skip steps or change your character later.\n\n### Level Up ![](asset://e89b8ef1ec30249c323952fdd70b696a=20)\n\nIf you already have a character of level 1 or higher, and wish to use the **Character Creation Wizard**, select this option instead. Just like creating a 1st Level character, you must be in a map with a token you onw and is set as PC, and you can skip steps and change your character later.",
        "4. The GM Menu": "# 4. The GM Menu\n\nIf you are a **GM**, these options will be only available to you.\n\n### Manage Party ![](asset://6ea9e45fbc6820f74ab0e626f0596f47=20)\n\nThe [r:macroLink(\"Party\",\"Manage Party@Lib:Character\")] menu will show a overview of all players in the **current map**, clicking on the names of the character will open it&apos;s character sheet, you can change the HP, it&apos;s current money, XP.\n\n[![party](https://i.imgur.com/bsgzLqv.png=400)](https://i.imgur.com/bsgzLqv.png)\n\n#### Poll\n\nThere is also a **Create Poll** link to prompt the players (and just the players) to vote on any **multiple choice** question.\n\nYou can then click the **Results** link to open a window with the current results. This can be used to check if everyone is back from a break, what directions the players want to take, who should get the magical item, help you decide the theme of the next adventure or anything you can think of.\n\nThe results are displayed on a window but you can share them in the chat if you wish.\n\n#### Group Sharing\n\nBelow the **party overview** you can load a pin on the map with XP and treasure to share. Pins will be detailed later, but for now, these options allow you to share a certain ammount of XP and money equally between players. XP can optionally be shared with NPCs that helped during combat, although the NPC will not actually get any XP, it will increase the number to share.\n\nThese options do not share items, but you can move them individually.\n\n### Manage Encounter ![](asset://9128743dc70d3f19d3b0a06678ffb26a=20)\n\nThis option will open a window with selected creatures, or alternativelly, creatures tied to a pin, and gives quick access to monsters visibility, statblock, HP, one attack roll and one damage roll, and it&apos;s CR and XP, and the total HP and XP of that encounter.\n\n### Pin Notes ![](asset://c8f8cbf97c984caec577d9512e94483a=20)\n\nThis option will open a window that allows the creation of pin to pin tokens that can store items, treasures and experience, as well as notes, this way you can prepare an encounter&apos;s rewards and notes. From the  **Manage Party**, you can share the the rewards between players.\n\nBy default, pins are invisible to players and not owned by anyone, but if you make them visible owned by all or any specific player, it can be used to store items like a cart, bag of holding, squire.\n\n### Request Roll ![](asset://274cb2ad110af815ee7c7d5b47989b0b=20)\n\nThis option will open an imput window with various dice rolls, ability and skill checks, saves, and others, that will request dice rolls from the owners of selected tokens. You can also add a custom message to display to the players.\n\n### Set NPC ![](asset://75f89d8c364ca21bda9aa7a6e1c7adb1=20)\n\nThis option will transform the selected token into an NPC, you can choose an existing creature, changing it, size, or add new. If you choose to add new, a new npc will be added to the framework and can be added again later.\n\nIf no token is selected, one will be created.\n\n### Settings ![](asset://c0100f0ce673af4ea0208892dd25fd01=20)\n\nThis option will open the Framework settings, from here you can change framework specific settings such as:\n\n- Manage equipment, features, spells and npcs.\n- Change the default attributes (like adding maddness and/or honor atributes)\n- change default skills (like add more, or change what atributes do they use by default)\n- change the GM and Player output (to open GM rolls, or show player rolls only to the GM)\n- What passive checks to display in the character sheet and token info\n- Change what feats, languages, classes and other character options are defaults\n- Change the starting map and welcome message\n- Change various display and gameplay mechanics",
        "5. Character Sheet": "# 5. Character Sheets\n\nTo create a character, open the **Compendium** and click **New Character** and then, follow the instructions.\n\nFrom this point, the macros are all into place and you can either complete the wizard or close/skip it and edit manually.\n\n### Character Sheet\n\nThe **Character** macro will open the character sheet, this sheet mimics the official D&amp;D 5e Character Sheet.\n\n[![](https://i.imgur.com/dkHeklq.png=400)](https://i.imgur.com/dkHeklq.png)\n\nMost features of the character sheet can be used as the following:\n\n- click on an **entry** like (Strength, Speed, Alignment or Flaws) to **change it**.\n- click on a **number** or **dice roll** will roll a dice \\(like an [attack](to hit \"4\"), skill check or [damage roll](roll \"1d8+2\")\\)\n- click on your HP to change it, or click on the **+** and **-** signals to quickly heal and damage.\n\nSkill checks, saving throws and attack rolls use the advantage/disadvantage rule, by default they use the first value, but you can use the higher one (Adv) or lower one (Dis) to represent advantage or disadvantage.\n\n#### Adding an Item and Feature\n\nClicking on **Equipment** and **Features &amp; Traits** will open a list to add to your character sheet, you can also use the [r:macroLink(\"search\",\"Search@Lib:Campaign\")] menu to open an item and move it to your character, you can then click on each Item to read more about them. each Item also have the following options:\n\n- **Edit** (Only visible to the GM) will allow you to change the item.\n- Remove will remove the item from your character, it will still be stored in the framework database and can be added later.\n- **Settings** will change character specific settings such as if an item is wilded with the offhand, if it is equiped, or be given a custom name, items can also be identified or not (this option only appears to the GM)\n- **Move** will create a copy of that entry into another character sheet, if it&apos;s an item, a quantity will be asked, if you transfer as much or more than you have, the item will be removed.\n- **Share** will open the entry in a shared frame to all players.\n\n### Description Sheet\n\nthis sheet contains the remaining information about your character, such as phisical description and portrait, background and additional features (such as eldritch invocations, fighting styles, metamagic, etc).\n\nJust as the **character sheet**, clicking on the title will allow you to change it that entry.\n\nThe **Portrait** and **Symbol** images can be either stored in the tokens portrait and handout respectively, or linked on **Character Appearance** and **Symbol** and pasting an external URL to an image will also display here.\n\n### Spellcasting Sheet\n\nThis sheet will show all your spells, Clicking on the Spell Save DC number will display it&apos;s value publicly, and on Spell Attack Bonus number will roll an spell attack roll.\n\n To add new spells you can either click the spell level number (the first number of each collumn) and choose an existing one or adding a new one, or using the [r:macroLink(\"search\",\"Search@Lib:Campaign\")] menu, open a spell and move it to your character.\n\nOn each spell, you can change it&apos;s settings to define the source of that spell (class, race, etc) so it can define it&apos;s default spellcasting atribute (in case of more than one), change it to a custom atribute, or if it is memorized or not.\n\nYou can change the next number (or + sign if empty) to define used and total spell slots for each level.\n\nSpells that you have prepared and have spell slots to cast will also be displayed in the **Attacks &amp; Spellcasting** section of your **Character Sheet**, as well as nessesary DCs and dice rolls.\n\n### Statblock\n\nThe statblock macro will display an overview of your character&apos;s skills similar to a mosnter statblock, you can change some of your atributes here, but it&apos;s more useful to keep track of your stats, resources and making skill checks in a compact window.",
        "6. Other Macros": "# 6. Other Macros\n\nThere are some other few macros on the that should be noticed.\n\n### Dice Macros\n\nFrom the Campaign frame, you can click the dice macros as is, or drag them to a PC token, Global macros or GM macros and edit them to change the dice roll for quick acess to custom dice rolls.\n\n### Load Overlays\n\nSometimes the overlays will freeze, preventing you to using most of the map, if that happens, go to the Campaign frame and click on the Load Overlays macro, it will reset the overlays and fix the problem.\n\n### Elevation\n\nThe **elevation macros** (- Elev and Elev +) will set the character&apos;s elevation in case it needs to be tracked, it increases and decreases in increments of 5ft, and the value is displayed in the mouseover stats.\n\n### Light and Range\n\nThe **Light** macro will set a light source of specified range at the character, and the **Range** macro will display an aura for melee and ranged attacks.\n\n[![](https://i.imgur.com/q4D8NQz.png=400)](https://i.imgur.com/q4D8NQz.png)\n\nThere are also a light and spell tokens for spells where you choose a point, or to lights on the map, not being carried by a creature.\n\n### GM Macros\n\nIn the GM macros, you can find a few useful macros:\n\n- **Show/Hide Token** to toogle player visibility faster, if you are the GM, the token will appear transparent so it is easier to figure if it is visible or not for the players.\n- **Expose Fog** and **Reset Fog** will expose the fog to all players, or reset them.\n- **Next** Goes to next token on the initiative order.\n- **Move Tokens** will copy the PC tokens in the **01.Start** map to the current map.\n- **Set Map** will set your current map to other players.\n- **Clear Initiative** will remove all tokens and players from the initiative tracker.\n\nYou can add more on your own, or drag the dice ones from the Campaign frame and edit them for custom dice rolls, as mentioned.",
        "7. Notebooks": "# 7. Notebooks\n\nAs mentioned [before](note \"2. The Framework Menu@Welcome\") framework supports notebooks like this one. To create one, open the framework menu and with a token selected, click **New Notebook**, the token selected should not be a PC.\n\n### Using a Notebook\n\nOnce you have created a new notebook, you can open it&apos;s index by opening the Notebook menu and clicking on it&apos;s name.\n\nThe index displays all sections of the notebook, click on any one to open that section.\n\n### Editing a Notebook\n\nOnce open, a window with an empty table of content will show, to add a new item, click on the **+** link you can start editing. Hit **Save** to submit the changes and a new entry will be created. Once you open any entry, a menu will be displayed above it&apos;s content, from there you can hit **Edit** to change it&apos;s content, **Settings** to change the **CSS theme**, share to open it in a shared frame to all players (they can not edit, just read) and &amp;lt;&amp;lt;&amp;lt; and &gt;&gt;&gt; signs to change pages.",
        "8. Markdown Syntax": "# 8. Markdown Syntax\n\nMany aspects of the framework use a modified [Markdown](https://www.markdownguide.org) syntax, here I will cover the default and custom syntax.\n\n## Default Syntax\n\nThe syntax outlined in John Gruber’s original [design document](https://daringfireball.net/projects/markdown/) are supported by most markdown editors, this notebook supports most of them, detailed below.\n\n##### Heading\n\nTo create a heading, use a \\# Sign in the beginning of the line, and the entire line will be converted to a heading, you can add as many as 6, each one making the header 1 level smaller, and the heading line should be separated from the rest of the content by one blank line.\n\nFor example this:\n\n```code\n# Heading 1\n\n## Heading 2\n\n### Heading 3\n```\n\nBecomes this:\n\n# Heading 1\n\n## Heading 2\n\n### Heading 3\n\n##### Paragraph\n\nTo create a paragraph, separate a block of text from another with a blank line, so this is a paragraph.\n\nAnd this is a new paragraph.\n\n##### Line Breaks\n\nTo create a line break, finish a line with two spaces and press return, this will create a line break.  \nLike this one.\n\n##### Emphasis\n\nYou can make a text *Italic* by surrounding a word or more with \\* signs. And **Bold** by adding two \\*\\*. You can add tree \\*\\*\\* to ***Combine*** them.\n\n##### Blockquotes\n\nTo create a blockquote, start a line with a &gt; sign, a space and add your text, you can even have blank lines and other elements inside it.\n\nFor example this:\n\n```code\n&gt; ##### Blockquote heading 5\n&gt; \n&gt; Blank line, **Bold**\n```\n\nBecomes this:\n\n&gt; ##### Blockquote heading 5\n&gt; \n&gt; Blank line, **Bold**\n\n##### Lists\n\nTo create unordered lists by starting a line with a - sign and a space and text, alternatively you can use an \\* or a + sign, and you can make an indented item adding a tab.\n\nTo create ordered lists, use a number (any number) and a . followed by space and text. ordered lists also accept indented items.\n\nExample:\n\n```code\n- item a\n- item b\n\t- item b1\n\t- item b2\n- item c\n\n1. item 1\n1. item 2\n\t1. item a\n\t1. item b\n1. item 3\n```\n\nBecomes:\n\n- item a\n- item b\n\t- item b1\n\t- item b2\n- item c\n\n1. item 1\n1. item 2\n\t1. item a\n\t1. item b\n1. item 3\n\n##### Horizontal Rulers\n\nto create an horizontal ruler, add at least tree ---, but you can have as many as you want.\n\nExample:\n\n```code\n---\n\n------------------------\n\n```\n\nBecomes this:\n\n---\n\n------------------------\n\n##### Links\n\nTo make a link, enclose the link text in \\[\\] followed by the URL enclosed by \\(\\), for example:\n\n```code\n[Duck](https://duckduckgo.com)\n```\n\nBecomes:\n\n [Duck](https://duckduckgo.com)\n\nYou can format links with bold and italic as well.\n\n##### Images\n\nSimilar to links, add a ! before the alt text enclosed with brackets and followed by the image url enclosed in parentheses to place an image. You can also add an = sign followed by a number after the URL to set a custom image size.\n\nExample:\n\n```code\n![alt text](https://i.imgur.com/jwPj9LV.png)\n![alt text](https://i.imgur.com/jwPj9LV.png=75)\n```\n\nbecomes:\n\n![alt text](https://i.imgur.com/jwPj9LV.png)\n![alt text](https://i.imgur.com/jwPj9LV.png=75)\n\n##### Escaping Characters\n\nYou can add a backlash before a character to escape the following:\n\n|Character|Name|\n|---|---|\n| \\\\ |Backlash|\n|\\#|Pound Sign|\n|\\_|Underscore|\n|\\{  \\}|curly braces|\n|\\[  \\]|brackets|\n|\\(  \\)|parentheses|\n|.|dot|\n|\\||pipe|\n|\\!|exclamation mark|\n|\\+|plus sign|\n| \\- |minus sign or hyphen|\n\n## Extended Syntax\n\nBesides the default syntax, this notebook accepts some of the aditional elements, detailed below.\n\n##### Tables\n\nTo create a table, separate each cell with \\|, each row with a new line, and the header from the body with --- for each cell, as the example:\n\n```code\n|number   |name    |\n|---------|--------|\n|1        |one     |\n|2        |two     |\n|3        |three   |\n```\n\nWill show as:\n\n|number   |name    |\n|---------|--------|\n|1        |one     |\n|2        |two     |\n|3        |three   |\n\nyou can also use : at the header separator to change table alignment, and spaces to format the raw table to look nice. as the example.\n\n```code\n|left|center|right|\n|:---|:---:|---:|\n|1|one|first|\n|2|two|second|\n|3|three|third|\n```\n\nWill show as:\n\n|left|center|right|\n|:---|:---:|---:|\n|1|one|first|\n|2|two|second|\n|3|three|third|\n\nThere are tools like this [Tables Generator](https://www.tablesgenerator.com/markdown_tables) to aid you to create tables, you can even import from a spreadsheet software.\n\n##### Striketrough and Underline\n\nSimilar to **Bold** and *Italic*, you can use two ~ to ~~striketrough~~ or a single \\_ to _underline_.\n\n##### Task lists\n\nTo create task lists, add a - followed by brackets with a space between to make a blank checkbox, or an x instead of a space to make a checked checkbox, like the following:\n\n```code\n\n- [ ] unchecked\n- [x] checked\n\n```\n\nBecomes this:\n\n- [ ] unchecked\n- [x] checked\n\nChecking the checkbox will not change it permanently, you have to edit the markdown to make the changes permanent.\n\n## Modified Syntax\n\nThis notebook also accepts unique elements made to interact with maptools and this framework, detailed below.\n\n##### Custom Codeblocks\n\nThis is similar to the normal codeblock most markdown editors use, but here they are used to display text boxes, as the example:\n\n```code\n\n##### Codeblock heading\n\nbody with elements like:\n\n- lists\n- *Bold* text\n- ~~striketrough~~ text\n\n```\n\n\nbecomes:\n\n```\n##### Codeblock heading\n\nbody with elements like:\n\n- lists\n- *Bold* text\n- ~~striketrough~~ text\n```\n\nAlso unedited text can be added by using `code` after the tree ticks in the beginning of the codeblock.\n\n##### Share Images\n\nIn MapTool, tokens named \"image:(name)\" are shortcuts to it&apos;s URI, so you can add images using that shortcut. But you can also create an image link to share to other players like an image link, but enclose the word share in parentheses, if you want the target to have an specific size, add an = sign followed by a number.\n\nExample:\n\n```code\n[![](image:D&amp;D=300)](share=500)\n```\n\nBecomes:\n\n[![](image:D&amp;D=300)](share=500)\n\n\n##### Dice Roll Links\n\nTo create a link to a dice roll, add the text in brackets like a link, then add the text roll followed by a space and the dice roll between quotes. the dice roll accepts attributes, class levels, and flat numbers as well as dices, see the examples:\n\n```code\n[1d8+1](roll \"1d8+1\")\n\n[greatsword](roll \"2d6+str\")\n\n[life domain healing word](roll \"1d4+spell+cleric\")\n```\n\nBecomes:\n\n[1d8+1](roll \"1d8+1\")\n\n[greatsword](roll \"2d6+str\")\n\n[life domain healing word](roll \"1d4+spell+cleric\")\n\nNotice that the attributes are not rolled, that&apos;s because these rolls are coming from a notebook without stats, if they are used in an item, spell or in the character sheet, the bonus will be applied.\n\nSimilar to dice rolls, you can make attack rolls replacing the roll text with to hit text, as the exemple:\n\n```code\n[weapon melee attack](to hit \"4\")\n```\n\nBecomes:\n\n[weapon melee attack](to hit \"4\")\n\n##### Database Links\n\nTo add a link to data inside this framework&apos;s database with the following syntax:\n\n```code\n[spell](spell \"Fireball\")\n[Greatsword](equipment)\n[yip yip](npc \"Kobold\")\n[the first page of this notebook](note \"1. Getting Started@Welcome\")\n```\n\nBecomes:\n\n[spell](spell \"Fireball\")\n[Greatsword](equipment)\n[yip yip](npc \"Kobold\")\n[the first page of this notebook](note \"1. Getting Started@Welcome\")\n\nNotice that if the words in brackets are exactly the same as the name of the item, there is no need to add the name in quotes.\n\nThe key words can be:\n\n|Data|Key|\n|---|---|\n|**spell**|spell, spells|\n|**equipment**|equipment, item, items|\n|**features** and **traits**|feat, feats|\n|**additional features**|additionalfeats, additional feats|\n|**npc**|npc|\n|**token**|token, pin|\n|**map**|map|\n|**pc**|pc|\n\nAlso note that to link a **note**, the quoted text must be \"Name of the chapter\" @ \"Name of the Notebook\", as seen in the example.\n\n##### Functions\n\nYou can include macro functions, for example getPlayerName, if and isGM can display [r:getPlayerName()] [r:if(isGM()==1,\"is the GM\",\"is not the GM\")].",
        "9. Advanced Options": "# 9. Advanced Options\n\nBy this point, I covered most of the tools in this framework, and its probably all you need to use it, but there are still some options worth mentioning.\n\n### Editing existing content\n\nAll entries that can be edited in a custom form window (any non default imput fields) support a modified [Markdown](https://www.markdownguide.org) syntax, most fields (like equipment and spells) even **require** that you use it. For exemple, weapons will search for the weapon type, check if the character is proficient, check if it should use strength or dexterity for the attack roll and define the damage dice, and spells will search for dice rolls and detect any required attack roll or save DC.\n\nIf you want to create new items, try copying an existing one and changing it, or simply mimicing how spells are displayed in the oficial D&amp;D material (like horizontal rules, description wording, etc...).\n\nThe data is stored in a JSON object, if any change breaks the item or character sheet, you can open the Lib:Character token or Character token and inspect the respective property.\n\n### Editing NPC Statblocks\n\nWith the exception of Skill checks and saving trows, that detect the bonuses in a list, NPC statblocks do not have any smart interactions with itens and spells, so they are simpler, just entry the information any way you want. But all changes (except HP, Size, token name, sight and token notes) are stored in the Framework, if you want to edit a creature outside the framework database (like a slightly stronger kobold, but keep the original and future ones intact) you can delete the **CreatureName** property in the token.\n\nJust like other content, the data is stored in a JSON object, so if any change breaks the statblock, check the Stats property.\n\n##### Using NPCs as PCs\n\nOn a related note, since it is simpler than a character sheet, it also loads faster, if you and your players don&apos;t need a fancy character sheet, you can set an NPC token as PC and use it as a statblock.\n\nGive it a try if any or all players prefer a faster, simpler character token, or you want to keep the character stored in the database, making all changes to that character global.\n\nBe aware that the party overview and item transfer will not work with this method.\n\n### Exporting and Importing Content\n\nIn the Framework Settings window, you can Export and Import the framework Compendium to your computer.\n\nYou can also Import content from outside, to do that, open and copy the content of a previously exported content and paste it on the text field in the Import option.\n\nThe merge will priorize new content, so if you have a Kobold you changed, and the imported content contains a different Kobold stat, it will override and the old one will be lost. This can be avoided simply by changing the name (to something like \"Kobold 2\" or \"Elite Kobold\") before importing.\n\nYou can also Save the Lib:Compendium token and replace the same token on another file, but this process will not merge existing content.\n\nTo export the class, race and background macros that automate character creation and level up, export the macro set from Lib:Compendium and import on another campaign file.",
        "10. Version History": "# 10. Version History\n\n**Current Version**: [r:getLibProperty(\"libversion\",\"Lib:Campaign\")]\n\nCheck for the [latest version](https://github.com/rtakehara/5e-Framework)\n\n### Changelog\n\n#### 2.5.7\n\n* Added a \"Note\" field to classes, now Circle of the Land Druids can track the spells at level up properly\n* Fixed some Druid bugs\n* Included an option to change currency weight, including zero\n* Cleaned the interface for setting currency value\n* Character currency interface now includes conversion rates and weight\n* Fixed blank Monsters when setting them to instance, than back to normal\n* Small bug fixes\n* Small interface fixes\n* Added missing equipment (vehicles) a few magical items\n\n#### 2.5.6\n\n* New interface to prepare all, none or selected spells\n* Tweaks to shortcut, now players `F2`, `F3` and `F4` will Interact (may not work on MapTool 1.7.0), Roll dice and open Statblock, GM shortcuts remain unchanged\n* Spellcasting now has an option to consume resources instead of slots (eg.: Charges)\n* Reroll Initiative Every Round option now finally works\n* small bugfixes\n\n#### 2.5.5\n\n* Added link to Class Spell Lists from the Spellcasting Sheet\n* Slight changes to darkvision color tint\n* Fixed spelling errors\n* Fixed tiny bugs\n\n#### 2.5.4\n\n* Dice rolls made from equipment, features or spells will display an link to the description dialog\n* Various improvements to the Cast option on the Spell description, such as:\n    * asking if you want to roll spell atack, share spell DC, what atribute to roll for DC\n    * auto detect if it needs a roll, DC and template\n    * automatically apply concentration and ask if you want to break concentration on a spell\n* Included a link on equiped weapon descriptions to attack (will consume ammunition if one is configured)\n* Included a link on features and additional features to consume resources, if the names match (for example, \"Metamagic: Carefull Spell\"  and \"Metamagic: Distant Spell\" will both consume the \"Metamagic\" resource)\n* Added a Rest macro to reset various resources based on short and long rest mechanics\n* Added support to fantasy languages\n* Included damage resistances, immunities, vulnerabilities and condition immunities to the character description sheet and statblock\n* Included option to share notebook pages on map\n* Notebook indexes now share a frame with the compendium\n* Included a Rules notebook with content from the SRD\n* Included Equipment Packs as items\n* Included Equipment Packs category on compendium and tables\n* New weather effects included\n* Included table blacklist in Settings to separate framework tables from game tables\n* Tiny performance improvements to the markdown syntax\n* Various small design changes\n* Various bugfixes\n\n#### 2.5.3\n\n* Statblocks now displays an Info window for both NPCs and PCs\n* Elevation now displays a bar when not at ground level\n* Distance between selected tokens now takes elevation into account\n* New output \"Ask\" will ask the output every dice roll\n* New quick toggle between All/Self for GM dice rolls\n* New setting to display statblocks on the same frame, separate PCs from NPCs or use individual frames\n* Creature List now can  sort by CR properly\n* Small bug fixes\n* Added input for custom skill, ability, save and attack rolls\n* Included a D&amp;D Beyond Monster and Spell importer\n\n#### 2.5.2\n\n* New tool to request specific dice rolls\n* Lots of improvements to spell slot and ammunition tracking\n* Improvements to NPC settings, skill checks and saving throws\n* New setting to automatically roll and apply random NPC Hit Points\n* Equipments now detect if an item is magical and puts on a separate table\n* Setting to allow players to view magic items\n* Pins now log item, currency and XP distribution\n* Various design improvements to overlays\n* Small bugfixes and visual changes\n* Quality of life improvements\n\n#### 2.5.1\n\n* New Manage Encounter window\n* Character Creation Wizard now includes \"Custom\" fields for Race and Background\n    * classes added through the settings without a proper macro automation will display the custom race and background input\n* Improvements to the Interact Macro\n* changed Spell template and Light tokens to support interaction\n* tokens markdown doesn&apos;t use maps, they will open tokens in the current map\n* new maps and PC links included in markdown\n* Compendium now opens on start\n* Statblocks now display token Image\n* Design changes, quality of life improvements and Bug fixes\n\n#### 2.5\n\n* PCs are now set as Library tokens so changes are updated globally\n* PCs and Maps now are displayed on the Compendium and search results\n* Added option to create character without importing a token first from the Compendium\n* Refresh link (now renamed Load) character now opens an input to choose what page to display\n* New macros added to PC tokens\n    * Interact will send an instruction to nearby tokens in the Object layer that allow player interaction, for now it works on doors but more interactions can be customized\n    * Area Template will create a template token to aid spellcasters\n* Statblock can now Make a token\n* PC and NPC dice rolls now impersonate the token\n* Mass initiative for NPCs\n* Added initiative button on the tracker overlay\n* Weather overlays on Map selector\n* Notebook Label Colors\n* Option to automatically detect and replace dice rolls\n* Various number fields now accept formulas\n* Added quick link to equipment quantity\n* Improvements to initiative overlay\n* Added Door automation for GM and Players\n* New icons, design and UX ajustments and improvements\n* small bugfixes\n\n#### 2.4.7\n\n* Improved initiative tracker design and customization\n* Auto set initiative now does a normal roll unless set differently\n* Option to hide grouped macros on selected token overlay\n* Moved Class Macros to Lib:Compendium\n* Overhaul on Conditions Input\n* Added Concentration state\n* Minor bug fixes\n\n#### 2.4.6\n\n* Updated to MapTool 1.7\n* Added overlays\n\t* Mini Menu Overlay\n\t* Selected Macros Overlay\n\t* Initiative Overlay\n\t* Shared Overlay\n* Design and minor quality of life improvements\n* Minor bug fixes\n\n#### 2.4.5\n\n* Added gameplay option to break initiative ties with Dexterity\n* Added support for proficiency on attribute checks\n* included all skill checks and saving throws on the statblock via an input window\n* Added custom attacks\n* Design and quality of life improvements\n* Minor bug fixes\n\n#### 2.4.4\n\n* Misspelling on class setup now doesn&apos;t break the class tables\n* Quality of life inprovements for adding equipments and spells (expecially when updating characters from previous versions)\n* Tiny improvement to search engine\n* Changed size modifier to carry capacity calculation to be manual for cases like firbolg&apos;s and goliath&apos;s powerful build trait.\n* Bug fixes\n\n#### 2.4.3\n\n* Fixed a minor bug when linking spells on items\n* Included search field on library\n* Improvements to search engine\n\n#### 2.4.2\n\n* huge performance improvements\n* minor design and UI improvements\n* minor bug fixes\n* Manage Party window now shows items\n* Changed some macros to facilitate creation of new classes, races and backgrounds, including Templates to use as a framework.\n* option to export and import the entire compendium\n* added help link on the notebook, with exemples of markdown syntax\n\n#### 2.4.1\n\n* minor bug fixes and design improvements\n* Added macro on the Compendium to update inventory and spellbook from characters and imported compendiums\n* Added option to pre-load dice sounds on startup.\n\n#### 2.4\n\n* Feats, additional feats, spells, equipments and bestiary are now on a compendium library, spells are not sorted by level anymore\n* weight now tracks coins\n* You can click on Other Proficiencies to make skill checks using tools, languages and everything else there\n* Hit Dice now can be rolled all at once instead of one by one.\n* Added book source tags and source management\n* Added image assets to bestiary, to use the resources must be loaded\n* Added sounds to dice rolls\n* Share now can be displayed to a single player or everyone\n* Added options to allow or limit player access to editing, sharing, closing shared, bestiary, identify equipment. These options are under player permissions\n* Changed Markdown sintax for internal links to make it easier to use\n\n#### 2.3.1\n\n* minor bug fixes and quality of life improvements\n\n#### 2.3\n\n* Added a Library window with organized content  including Classes and Subclasses, Races, Backgrounds, Equipment, Class Spells, Feats, Notebooks and Rollable Tables\n\n#### 2.2\n\n* Added option to apply damage/heal clicking on the result, and now hidden results can be shared (and fudged!)\n* Added option to select a spell slot for higher level casting\n* Design improvements.\n\n#### 2.1\n\n* Added a window interface for spells, equipment table and rollable tables.\n* Bug fixes and design improvements.\n\n#### 2.0\n\n* Complete rework on the conversion from Markdown to HTML, because of this, this notebook can only be used with the new 5e Framework.\n* Complete rework on how the data is stored, now it will present less bugs.\n* Now the notebook has it&apos;s own editor window.\n* Changes to the custom markdown syntax, now tables can have alignment, and links can open items, spells, features and even statblocks inside the framework.\n* You can share a page with the players on a shared frame.\n* You can make a link to other notebook pages as well.\n\n#### 1.22.3\n\n* Slightly changed how the index is organized\n* Fixed errors you get when naming macros with parentheses or commas\n* Added a Loading window to have some feedback when loading macros.\n\n#### 1.22.2\n\n* Fixed how hyphens inside tables converted to empty lists\n* Replaced Cyberpunk css theme with Github\n\n#### 1.22.1\n\n* Fixed titles showing multiple times when using more than 1 top level heading in the same macro\n\n#### 1.22\n\n* The index now searches headings 1 and 2 instead of looking for macros and groups\n* groups now separate the index in parts similar to groups\n* Minor quality of life changes\n* Minor bugfixes\n\n#### 1.21\n\n* Added support to store data in other Lib:Tokens and use one single Notebook token\n* New interface for options\n* 4 new built in themes, MapTool, MT Dark, D&amp;D and Cyberpunk\n\n#### 1.2\n\n* Added a Dice calculator that is now the default dice roller\n* Added support to one level of nested lists and blockquotes\n* Added support for alt text on images\n* Added a new type of code block that ignores formatting and a in line option to do the same\n* Added support for MapTool functions\n* Improvements to HTML\n\n#### 1.11\n\n* Added option to close shared content\n* Added Import/Export options\n* Minor bugfixes\n\n#### 1.1\n\n* Changed how sharing works\n* Added option to share Handout images\n* Minor bugfixes"
    }
}